{
  "document_title": "Movie Document",
  "created_date": "2025-11-16",
  "sections": [
    {
      "heading": "Introduction",
      "content": [
        {
          "type": "paragraph",
          "text": "Dangal"
        },
        {
          "type": "paragraph",
          "text": "Dangal (transl. 'wrestling bout') is a 2016 Indian Hindi-language biographical sports drama film directed by Nitesh Tiwari and produced by Aamir Khan and Kiran Rao under Aamir Khan Productions with Siddharth Roy Kapur under The Walt Disney Company India. The film stars Khan as Mahavir Singh Phogat, a pehlwani amateur wrestler who trains his daughters Geeta Phogat and Babita Kumari to become India's first world-class female wrestlers.[9] Fatima Sana Shaikh and Sanya Malhotra portray the adult versions of the two Phogat sisters, Zaira Wasim and Suhani Bhatnagar their younger versions, Sakshi Tanwar their mother, and Aparshakti Khurana adult version of their cousin, Ritvik Sahore his younger version, all of them except Shaikh, Tanwar and Sahore in their film debuts."
        },
        {
          "type": "paragraph",
          "text": "Development on the film began in early 2013 when Tiwari began writing the script. Khan had interviewed the Phogat sisters in 2014 on his talk show Satyamev Jayate, before Tiwari approached him with the script months later, after which Khan became the lead actor and producer. Set primarily in the Indian state of Haryana, principal photography commenced in September 2015 in the neighbouring Punjab.[10] Satyajit Pande served as the cinematographer and Ballu Saluja as the editor. Pritam scored the film's background music and soundtrack, lyrics for which were written by Amitabh Bhattacharya.[11][12] Kripa Shankar Patel Bishnoi, a coach with the Indian women's wrestling team, trained Khan and the cast for the wrestling sequences.[13]"
        },
        {
          "type": "paragraph",
          "text": "After a North American premiere on 21 December 2016, Dangal was released worldwide on 23 December to universal critical acclaim, with praise centered on the film's \"honest\" depiction of a real-life story and Khan's performance, including the emotional weight. It was also screened at the Beijing International Film Festival in April 2017 and second BRICS festival in June 2017.[14] At the 62nd Filmfare Awards, it won four awards: Best Film, Best Director, Best Actor (Khan) and Best Action (Shyam).[15] At the 64th National Film Awards, Wasim won Best Supporting Actress for her portrayal of Geeta's younger self. Overseas, Dangal won the inaugural Best Asian Film award at Australia's 7th AACTA Awards,[16][17] 2017's Best Foreign Film and Top Foreign Actor (for Aamir Khan) from China's Douban Film Awards,[18][19][20] and two Jackie Chan Action Movie Awards,[21] and was nominated in the Asian Brilliant Stars category at the 68th Berlin International Film Festival.[22]"
        },
        {
          "type": "paragraph",
          "text": "Dangal was a commercial success, setting several records at the box office including highest-grossing Hindi film, highest-grossing Indian film worldwide, the 46th highest-grossing non-English film (5th highest at the time of release),[23][24] and the 19th highest-grossing sports film worldwide.[25] Produced on a budget of ₹70 crore (US$8.3 million),[3] the film grossed ₹1,968−2,024 crore (US$340 million),[4][5][26][27] worldwide by various different estimates, including $216.2 million in China,[28] becoming one of the country's top 20 highest-grossing foreign films.[29] According to some estimates, it remains the only Indian film to cross the ₹2000 crore mark, to this day.[30] The film has also been watched more than 400 million times on Chinese streaming platforms, as of November 2018.[31][32][33]"
        },
        {
          "type": "paragraph",
          "text": "Plot"
        },
        {
          "type": "paragraph",
          "text": "Mahavir Singh Phogat, a former amateur wrestler trained in the pehlwani style of Indian wrestling, is a national wrestling champion residing in Balali, Haryana. His average Indian father forces him to give up the sport to obtain gainful employment. Dejected he could not win a medal for his country, he vows that his unborn son will. Disappointed on having four daughters, he gives up hope. But when his older daughters Geeta and Babita come home after beating two boys in response to derogatory comments, he realizes their potential to become wrestlers and begins coaching them."
        },
        {
          "type": "paragraph",
          "text": "His methods seem harsh. He forces them to do grueling early morning workouts, and forcefully gets their hair cut short. Despite facing backlash from the villagers, he goes on training them in his makeshift mud pit. Initially, the girls resent their father for his treatment but soon realize that he cares for their future. Motivated, they willingly participate in wrestling tournaments where they defeat boys. Unable to afford wrestling mats, Mahavir uses mattresses and trains them in freestyle wrestling to prepare them for competitive events. Geeta goes on to win the junior and senior championships at the state and national levels before heading to the National Sports Academy in Patiala to train for the forthcoming Commonwealth Games."
        },
        {
          "type": "paragraph",
          "text": "Once there, Geeta makes friends and begins to disregard the discipline taught by Mahavir under duress from her coach Pramod Kadam, whose training methods and wrestling techniques completely differ from her father's. Therefore, she loses every match at the international level. During a visit home, she defeats a visibly exhausted Mahavir in a ferocious bout after egotistically mocking him. Babita reminds Geeta of her mistake and that she should respect Mahavir. Soon after, Babita wins the national championship and follows Geeta to the academy. After the two sisters have an emotional conversation in which Babita provides her encouragement, Geeta tearfully makes peace with Mahavir."
        },
        {
          "type": "paragraph",
          "text": "Before the Commonwealth Games, Pramod forces Geeta to compete in the 51 kg weight class rather than in her usual 55 kg. Irritated upon learning this, Mahavir goes to Patiala with his nephew Omkar and begins coaching the girls secretly. Learning about this, and furious with Mahavir's interference, Pramod wants the girls expelled; the sports authority issues a warning but allows them to continue. Mahavir is barred from entering the academy, and the girls are forbidden to go out. Determined to continue assisting his daughters, Mahavir obtains tapes of Geeta's previous unsuccessful bouts and coaches her by pointing out her errors over the phone."
        },
        {
          "type": "paragraph",
          "text": "At the games, competing in the 55 kg class, Geeta eases her way into the final. Mahavir constantly contradicts Pramod's instructions while sitting in the audience, and she follows her father's instructions instead. Just before the gold medal bout, jealous Pramod conspires to lock Mahavir in a room."
        },
        {
          "type": "paragraph",
          "text": "In the bout, Geeta manages to win the first session but loses the second. Trailing 1–5 in the final session and with nine seconds left, she recalls the tactics taught by her father and a 5-pointer, and executes it on her opponent in the final three seconds, taking the score to 6–5 in her favor, thus winning the session and the bout 2–1. In the process, she becomes the first Indian female wrestler to win gold at the Commonwealth Games. Mahavir returns just in time to embrace his daughters, dashing Pramod's hopes of obtaining credit before the news media."
        },
        {
          "type": "paragraph",
          "text": "Cast"
        },
        {
          "type": "paragraph",
          "text": "Geeta Phogat, Zaira Wasim, Suhani Bhatnagar and Babita Kumari at the film's special screening"
        },
        {
          "type": "paragraph",
          "text": "Aamir Khan as Mahavir Singh Phogat"
        },
        {
          "type": "paragraph",
          "text": "Sakshi Tanwar as Daya Shobha Kaur – Mahavir's wife"
        },
        {
          "type": "paragraph",
          "text": "Fatima Sana Shaikh as Geeta Phogat – Mahavir's eldest daughter"
        },
        {
          "type": "paragraph",
          "text": "Zaira Wasim as Child Geeta"
        },
        {
          "type": "paragraph",
          "text": "Sanya Malhotra as Babita Kumari – Mahavir's second daughter"
        },
        {
          "type": "paragraph",
          "text": "Suhani Bhatnagar as Child Babita[34]"
        },
        {
          "type": "paragraph",
          "text": "Aparshakti Khurana as Omkar Singh Phogat – Rajpal's son; Mahavir's nephew"
        },
        {
          "type": "paragraph",
          "text": "Ritvik Sahore as Teenage Omkar"
        },
        {
          "type": "paragraph",
          "text": "Ananya Sharma as Child Ritu Phogat – Mahavir's third daughter"
        },
        {
          "type": "paragraph",
          "text": "Lakshita Goyal as Child Sangeeta Phogat – Mahavir's youngest daughter"
        },
        {
          "type": "paragraph",
          "text": "Girish Kulkarni as Pramod Kadam – Coach at the National Sports Academy"
        },
        {
          "type": "paragraph",
          "text": "Vivan Bhatena as Harkinder – Mahavir's colleague"
        },
        {
          "type": "paragraph",
          "text": "Shishir Sharma as Head of Department of the National Sports Academy"
        },
        {
          "type": "paragraph",
          "text": "Meenu Prajapati as Jasmeet – Geeta's friend at the National Sports Academy"
        },
        {
          "type": "paragraph",
          "text": "Badrul Islam as Shamim – Owner of meat shop[35]"
        },
        {
          "type": "paragraph",
          "text": "Karmveer Choudhary as Maan Singh Phogat – Mahavir's father"
        },
        {
          "type": "paragraph",
          "text": "Anurag Arora as Rajpal Singh Phogat – Mahavir's brother; Omkar's father"
        },
        {
          "type": "paragraph",
          "text": "Production"
        },
        {
          "type": "paragraph",
          "text": "Development"
        },
        {
          "type": "paragraph",
          "text": "Aamir Khan and Mahavir Singh Phogat at the film's special screening"
        },
        {
          "type": "paragraph",
          "text": "Divya V. Rao, a member of Disney's creative team, read a newspaper article in 2012 about Mahavir Singh Phogat, who trained his daughters to become world champions. She thought this would make for a great film, and spoke about this to Kapur and other Disney personnel. Disney approached Nitesh Tiwari to write and direct the story. Tiwari met Phogat and his daughters, who instantly agreed to tell the story.[36] Tiwari worked on the script for close to a year with Gupta, Jain and Mehrotra before going to Ronnie Screwvala, the CEO of UTV Motion Pictures, and Kapur with the final script, while suggesting that Aamir Khan play Phogat.[10]"
        },
        {
          "type": "paragraph",
          "text": "Months prior to being approached for with the script, Khan had invited the Phogat sisters onto his television talk show Satyamev Jayate, interviewing them on the first episode of season three in 2014.[37] A few months after he interviewed them on Satyamev Jayate, he was approached by Tiwari.[38] Kapur and Tiwari went to Khan with the story, and Khan loved it in its first narration. Khan had just finished Dhoom 3 and had begun shooting for PK. He wanted to do the film after 5–10 years when he would turn 60 because the role demanded him to be 55 and he was still doing younger roles. But the story remained in his mind and a few months later, he called up Tiwari and asked him to narrate the script once again.[39]"
        },
        {
          "type": "paragraph",
          "text": "After the release of PK in 2014, Khan announced that he would play the role of a wrestler in his next film titled Dangal directed by Tiwari, a cinematic biography of the former wrestler Mahavir Singh Phogat.[40] Khan, who was to produce the film himself with Disney, said to reporters, \"Nitesh has written a wonderful story. The topic is very important, it's very dramatic. It highlights the discrimination that is meted out to the girl child in India. The best part is that he has done it in a very entertaining manner. The heart of the story is emotional, but it also has a lot of humor. Raju Hirani has this unique way to tell a story where he says something socially very relevant but he tells his story in a very entertaining manner. Similarly, Nitesh has written a very entertaining lovely script, the dialogues are very entertaining. Each time I listen to the dialogues, I laugh a lot. I cry as well as laugh.\"[41]"
        },
        {
          "type": "paragraph",
          "text": "In March 2015, Junior Indian women's wrestling team coach Kripa Shankar Patel Bishnoi was approached by Aamir Khan Productions to train Khan and the entire crew of Dangal. Bishnoi said about the film in a Hindustan Times interview, \"Very few Indians encourage women for wrestling, especially because of the uniform. This film will change that perception too. People would hopefully want to see their daughters taking up wrestling as a sport.\"[42]"
        },
        {
          "type": "paragraph",
          "text": "Khan lost some weight and took Haryanvi lessons and dialect training for the film.[43][44] He played two distinct roles in the film: the 60-year-old wrestler Mahavir Singh Phogat, and the 20-year-old version of Phogat. Khan reportedly gained 30 kg and weighed 98 kg to play the role of the older Phogat, and then lost the weight to play the younger role in Dangal.[45][46] The film was produced on a budget of ₹70 crore (US$10.42 million).[3]"
        },
        {
          "type": "paragraph",
          "text": "Casting"
        },
        {
          "type": "paragraph",
          "text": "In March 2015, Taapsee Pannu, Deeksha Seth and Akshara Haasan were being considered for the roles of Khan's on-screen daughters.[47] In April, Shaikh and Malhotra were cast as the daughters, who hailed from the Jat community of Balali village of Bhiwani, Haryana.[48][49][50] Geeta Phogat had participated in the London Olympics in 2012,[51] while Babita had won the gold medal in the 2014 Commonwealth Games in Glasgow.[52][53] In June 2015, Wasim and Bhatnagar were roped in as child actors for the film.[54] Khurana was also cast in the film, making his debut after a career as a VJ.[55] Mukesh Chhabra served as the casting director, with Vikram Singh being recruited to play the role of the villain.[56][57] Khan's nephew Pablo, who is the son of Mansoor Khan, was the film's assistant director.[58][59] Mallika Sherawat auditioned for a role. Mrunal thakur also auditioned however she opted out citing scheduling conflicts.[60][61] In August 2015, Rajkumar Rao, who previously worked with Khan in Talaash, was approached for an important role.[62] After auditioning 70 actresses for the role, Tanwar was brought on as Daya Kaur, the wife of Mahavir Singh Phogat.[63][64][65] Ananya was chosen to play Sangita, the youngest daughter of Mahavir Phogat.[66][67] In October 2015, Vivan Bhatena, who appeared in a key role in Talaash, was selected to play a supporting role in the film.[68] In an interview in January 2017, Rao stated that if Khan had declined the role, the only other choices would have been Mohanlal and Kamal Haasan.[69]"
        },
        {
          "type": "paragraph",
          "text": "For the film's Tamil language dub, Khan initially approached Rajinikanth to voice his role. Despite Rajinikanth enjoying the film, they both eventually decided against it, as they found Rajinikanth's voice to be too recognizable to go along with Khan's appearance.[70]"
        },
        {
          "type": "paragraph",
          "text": "Filming"
        },
        {
          "type": "paragraph",
          "text": "Fatima Sana Shaikh and Sanya Malhotra on the sets of Dangal"
        },
        {
          "type": "paragraph",
          "text": "To prepare for the role, Shaikh and Malhotra watched several videos on wrestling to understand \"how wrestlers move, walk, their body language\".[71] Both Malhotra and Sheikh went through five rounds of auditions, physical training and workshops with Tiwari and Khan. They were trained by coach and former wrestler Kripa Shankar Patel Bishnoi.[13] From September 2015 to December 2015, Khan gained 9% fat, weighing around 98 kg for Dangal, and from January 2016 to April 2016, he regained the shape that he had opted for in Dhoom 3 and would hear the script for next future films, halting shooting of Dangal for said period.[72]"
        },
        {
          "type": "paragraph",
          "text": "The shooting schedule of Dangal began on 1 September 2015.[73][74] The villages of Ludhiana were given a Haryanvi transformation.[75][76] The shooting took place in the villages of Gujjarwal, Narangwal, Kila Raipur, Dango and Leel in Punjab and Haryana.[77][78] The village of Dango, which is in the Pakhowal Tehsil in Ludhiana, is veteran actor Dharmendra's ancestral village.[79]"
        },
        {
          "type": "paragraph",
          "text": "The first scene was shot on 21 September 2015, in Ludhiana with the presence of Mahavir Singh Phogat and his daughters, Geeta and Babita.[80] On 14 November 2015, while shooting in Ludhiana, Khan suffered minor injuries resulting in muscle spasms in his back.[81][82] On 20 November 2015, Khan collapsed after sustaining a shoulder injury on the set.[83] After his recovery, he resumed shooting in Pune on 9 December 2015.[84]"
        },
        {
          "type": "paragraph",
          "text": "The team filmed in and around stadiums at the Shree Shiv Chhatrapati Sports Complex in Pune. At the time, the complex hosted the 2015 Roll Ball World Cup, and athletes of the Netherlands national rollball team and Slovenia women's national roll ball team were recruited to play background athletes in the film. The team also shot some portions of the film in Symbiosis International University, Pune.[85][86]"
        },
        {
          "type": "paragraph",
          "text": "On 19 January 2016, Khan and the entire crew of the film shot in Delhi, at Talkatora Stadium, to film wrestling sequences. The crew then moved to Thyagaraj Stadium to shoot sequences of Commonwealth Games and National Games.[87] The first schedule of shooting was also done in schools and in Dango village.[88]"
        },
        {
          "type": "paragraph",
          "text": "The second schedule of the film started on 16 June 2016, at the Akhada Leel near Toosa village, in Ludhiana district. It is one of the largest villages in Punjab. Khan said, \"When I came to Ludhiana, I was very fat. At that time, we shot for the scenes where Mahavir has become old. 85 percent of the film is about his 'old' look only. Now we are shooting for the portion when Mahavir was young.\"[89]"
        },
        {
          "type": "paragraph",
          "text": "With the film being set in multiple decades, the cinematographer Satyajit Pande and colorist Ashirwad Hadkar experimented with a number of tests for skin tones and costumes during the pre-production stage. Natural light was majorly employed in the film. To portray the 1980s, the \"sources [were kept] white-hot and the skin tones yellow-warm\" for the day sequences, and \"a consistent bulb warm tone was maintained\" for the night sequences. With varying colour temperatures in the process of filming over an entire day starting early mornings until late evenings, visual effects plates were used and digital intermediate process employed.[90]"
        },
        {
          "type": "paragraph",
          "text": "Music"
        },
        {
          "type": "paragraph",
          "text": "Main article: Dangal (soundtrack)"
        },
        {
          "type": "paragraph",
          "text": "The music for the film is composed by Pritam, with lyrics penned by Amitabh Bhattacharya in Hindi, Rajesh Malarvannan in Tamil and Rajshri Sudhakar in Telugu.[91] Daler Mehndi sang the film's title track.[92] The song \"Dhaakad\" was sung by rapper Raftaar and became popular[93] receiving 12 million views, in three days. Khan rapped his own version of the song and included it in the album.[94] The soundtrack album was released on 23 November 2016, in Hindi and 26 November 2016, in Tamil and Telugu, under the Zee Music Company label.[95] The film's soundtrack album is set to have a Japanese release published by Rambling Records on 13 April 2018.[96]"
        },
        {
          "type": "paragraph",
          "text": "Release"
        },
        {
          "type": "paragraph",
          "text": "Dangal was released in the United States on 21 December 2016, and worldwide on 23 December 2016.[97] The film was shown on an estimated 4,300 screens in India and 1,000 screens internationally.[98][99] It was also released in Tamil and Telugu dubbed versions as Yuddham.[100][101] It was declared tax-free in six Indian states – Uttar Pradesh, Uttarakhand, Haryana, Chhattisgarh, Delhi and Madhya Pradesh – to promote Beti Bachao, Beti Padhao, a Government of India's social campaign aiming to reduce the selective abortion of females, to protect girls, and to educate them.[102][103][104][105][106][107]"
        },
        {
          "type": "paragraph",
          "text": "Dangal's second phase of release was in the Chinese markets of East Asia, starting with Taiwan on 24 March 2017.[108] Dangal was screened at the 7th Beijing International Film Festival, the first Indian film to be screened at the festival, in the non-competing panorama section in April 2017 as Shuaijiao Baba (Let's Wrestle, Father!), and received a standing ovation. The screening was attended by a number of Chinese celebrities, including actress Liu Yifei and actor Wu Gang.[109] It released theatrically in China on 5 May 2017, on 9,000 screens, \"the widest ever release for an Indian film in any territory\", and opened to overwhelming response from critics and audiences alike.[110] However, the film was trimmed by 20 minutes \"to be in line with what the Chinese are used to.\"[111] The film released in Hong Kong on 24 August 2017.[112]"
        },
        {
          "type": "paragraph",
          "text": "In June 2017, Khan announced plans to release the film in Japan and South America.[113] Dangal released in Japan on 6 April 2018,[114][115] and was the first film to be co-distributed by Disney with Japan's Gaga Corporation.[116] Its Japanese language title is ダンガル きっと、つよくなる (Dangaru Kitto, Tsuyoku Naru), which has some similarity to the Japanese title of 3 Idiots (Kitto, Umaku Iku).[117] A preview of Dangal was held on 25 January 2018, by the Japan Wrestling Association, whose chairman recommended the film as inspiration for the 2020 Tokyo Olympics.[118] Another preview screening was held for the Japan Olympic wrestling team during training camp in February 2018, and was well received by the audience.[119][120]"
        },
        {
          "type": "paragraph",
          "text": "Dangal was released in South Korea on 25 April 2018.[121] The film had its South Korean premier on 23 April 2018, which was attended by the South Korean female wrestling team for the 2018 Asian Games.[122]"
        },
        {
          "type": "paragraph",
          "text": "Reception"
        },
        {
          "type": "paragraph",
          "text": "Critical response"
        },
        {
          "type": "paragraph",
          "text": "Zaira Wasim and Fatima Sana Shaikh were praised by many film critics for their portrayal of young and adult Geeta Phogat."
        },
        {
          "type": "paragraph",
          "text": "On the review aggregator website Rotten Tomatoes, 89% of 18 critics' reviews are positive, with an average rating of 7.8/10.[123]"
        },
        {
          "type": "paragraph",
          "text": "Critics often praised the portrayal of the subject matter in Dangal. Rachit Gupta of Filmfare magazine gave the film a full five-star rating calling it \"perfect in every sense of the word.\" He added, \"The film's direction and writing is so riveting that it coaxes it's the viewer to stand up and applaud. Great editing and filmmaking technique aside, Dangal features wrestling matches that are authentic and real.\"[124] Meena Iyer of The Times of India called it \"inspiring and entertaining\" and awarded a four-and-a-half out of five star rating. She commended the writing of being for \"tongue-in-cheek quality, peppered with humour and several poignant father-daughter emotions.\"[125] Shubhra Gupta of The Indian Express gave a three out of five star rating and stated that the film worked on two parameters: that it is a \"straight-forward film about a popular sport\" and the \"strong feminist statement about girls being the equal of boys, if not better, in an area they've never been seen, let alone accepted.\"[126] Saibal Chatterjee of NDTV gave the film four out of five stars and calling it a \"hugely entertaining sporting saga\", pointed out that unlike other Bollywood films, Dangal does not \"go for broke in terms of melodramatic flourish\" and that it refrains from \"demonstrative chest-thumping and flag-waving\". He felt it blended \"humour with intensity, and intimacy with spectacle, to perfection.\"[127]"
        },
        {
          "type": "paragraph",
          "text": "Ananya Bhattacharya of India Today gave a four out of five-star rating and wrote, \"the fights, emotional turmoil, the father-daughter tiffs, take centre-stage in Dangal.\" She added, \"Tiwari uses every single trope in the book of Bollywood sports films ... with a freshness and expertise seldom seen.\"[128] Awarding the film a full five stars, Rohit Bhatnagar of Deccan Chronicle called it \"an unmissable epic\". Terming the narrative \"engaging to the core\", he drew comparisons to Chak De! India, while commending the acting performances and cinematography.[129] Sukanya Verma of Rediff.com felt that Dangal was \"one of those few films that discuss strategy and technique in a manner that's easy and entertaining to grasp\". Calling it an \"exhilarating creation\" and praising the acting performances, she wrote, \"the raw, rough, visceral choreography of the fights ... evokes sheer awe\".[130] Lisa Tsering of The Hollywood Reporter felt the film is driven by \"emotional resonance, technical artistry and compelling performances\" while adding that \"it's so thrilling to watch. Not only do the family scenes ring true, but Tiwari approaches the wrestling sequences with intelligence and sensitivity.\"[131]"
        },
        {
          "type": "paragraph",
          "text": "There is not a trace of superstar-about Aamir Khan or a hint of vanity. For most of the film, he's an old, overweight man. Given the Bollywood obsession with looking youthful and flaunting six-packs, this itself is an act of courage. But Aamir doesn't just look the part. He also becomes it. He is by turns, ferocious and tender ... It's a masterful performance."
        },
        {
          "type": "paragraph",
          "text": "Anupama Chopra of Film Companion[132]"
        },
        {
          "type": "paragraph",
          "text": "While commending the acting performances of all the lead actors, most critics focused praise on Khan's performance. Deepa Gauri of Khaleej Times wrote that Khan \"puts in such an earnest and inspired performance that [it] will go down in the history of Indian cinema as one of the finest.\"[133] Maitland McDonagh wrote for Film Journal International that \"[a]ll four actresses playing Geeta and Babita are strikingly good, and Khan stands out as the deeply flawed Mahavir.\"[134] Aniruddha Guha of MensXP.com thought that Khan captured the character's \"highs and lows with flourish\" and called it a \"truly great performance\", while adding that \"the girls of 'Dangal' are a real find.\"[135] Rohit Vats of Hindustan Times called it \"best performance till date\".[136] Raja Sen of Rediff.com felt Khan's character was \"both fascinating and flawed\" and added that he is \"a winner utterly sure of his beliefs who bends the world around him to his will. It is the performance of a lifetime\".[137] Baradwaj Rangan of The Hindu noted in his personal blog that Khan brought out the contradicting nature of the character \"beautifully\" and called it \"one of his finest performances.\"[138] Variety magazine's Owen Gleiberman felt that Khan, despite looking like a \"jock version of Salman Rushdie ... with a tight-lipped mask, [he] finds a hundred ways to communicate emotion.\"[139]"
        },
        {
          "type": "paragraph",
          "text": "The film had its share of detractors who, while praising the narrative and performances, felt that the concept of feminism portrayed in the film was flawed. They pointed out that the wrestler-father, in pursuit of his goal of winning a medal for the country, trains his daughters against their will. Reviewing for The Hindu, Namrata Joshi wrote that the film despite aiming not to hide \"chinks in the feminist armour\", it does not explore its \"dilemmas and complexities\" and only \"brush[es] things under the easy nationalistic carpet\" by \"justifying everything with \"nation before the individual\" logic.\" She complained of the \"easy celebration of the supposed fall of patriarchy\" depicted in the film and maintained that \"men actually still remain very much in control.\"[140] The view was echoed by Vartika Pande, in her \"Feminist Reading\" of the film for feminisminindia.com, who wrote, \"Dangal ends up being a film about a patriarch at the helm who \"empowers\" women and obviously takes all the accolades.\"[141] Al Jazeera's Azad Essa, while reviewing the film for Independent Online observed that \"the elevation of women is still a manifestation of an unfulfilled male dream. It is the male coach who emerges as the true hero, and not the women.\"[142] Strong responses on similar lines from a small section of the Chinese viewers met the film, where, following the release, a fresh debate on feminism began.[143] A viewer complained that the film \"reeks of patriarchy and male chauvinism\".[144]"
        },
        {
          "type": "paragraph",
          "text": "Criticism was also directed at other areas of the film such as the characterisation of the coach at the academy. Uday Bhatia of Mint felt it was \"incompetent and vindictive\".[145] Rajeev Masand felt it was \"shoddy\" and that the \"twist in the film's final act ... came off as completely unconvincing\".[146] Tanul Thakur of TheWire.in also felt that the coach was \"reduced to a caricature\" and that \"he simply exists because Aamir can become a hero.\" Thakur wrote that the second half of the film was \"repetitive and bloated\" and that it uses \"clichés ... needlessly trying to inject drama\".[147]"
        },
        {
          "type": "paragraph",
          "text": "In Hong Kong, Nicola Chan of South China Morning Post rated the film 5 out of 5 stars.[148] In Japan, Yuri Wakabayashi of Eiga gave the film a positive review.[149] Yoshika Yamada of IGN Japan called the film a \"masterpiece\" and rated it 9 out of 10.[150] Zakzak rated the film 4 out of 5 stars.[151] The film has received praise from a number of Japanese celebrities, including film critic Takeo Matsuzaki, television personality Tsutomu Sekine, video game developer Hideo Kojima, manga authors Keisuke Itagaki and Noboru Kawasaki, and athletes including Olympic wrestlers Saori Yoshida and Kazuhito Sakae, professional wrestlers Antonio Inoki and Tatsumi Fujinami, tennis player Shuzo Matsuoka, and weightlifter Hiromi Miyake.[152] Upon release in Japan, it ranked first among early April 2018 releases in audience polls conducted by Filmarks (4.22 out of 5 stars)[153] and PIA[154] (93.3 out of 100).[155]"
        },
        {
          "type": "paragraph",
          "text": "Box office"
        },
        {
          "type": "paragraph",
          "text": "See also: List of highest-grossing Indian films"
        },
        {
          "type": "paragraph",
          "text": "Dangal grossed ₹716 crore after its initial run. It included ₹511 crore in India and ₹205 crore overseas.[156] After it collected a nett of ₹345 crore over its third weekend from release, it beat the record held by PK for the highest grossing Indian film.[157]"
        },
        {
          "type": "paragraph",
          "text": "Dangal became highest grossing Indian film worldwide in July 2017, with an estimated gross of ₹2,000 crore by some sources, after its second phase of release in China and Taiwan. These numbers could be fake as there are no concrete source for these.[158][159] In July 2017, a spokesperson for Aamir Khan denied the reports that Dangal has crossed ₹ 2,000 crore worldwide.[160]"
        },
        {
          "type": "paragraph",
          "text": "The worldwide distributor share of Dangal was ₹525 crore as of 1 June 2017.[158][161] As of June 2017, the worldwide gross of Dangal stood at US$307 million (₹2,000 crore).[23][24] Dangal emerged as 30th highest-grossing film of 2016 worldwide and the fifth highest-grossing non-English film of all time.[24][162][163] The Movie was marketed by a Mumbai Based company named Spice PR owned by Prabhat Choudhary.[164]"
        },
        {
          "type": "paragraph",
          "text": "Dangal is the first Indian film to gross $300 million worldwide,[24] and one of the top 30 highest-grossing 2016 films. Dangal is also the highest-grossing sports film, and Disney's fourth highest-grossing film of 2017.[192] Dangal is also the first Indian film to exceed $100 million[193] and ₹1,000 crore overseas,[194] grossing around ₹1,459 crore (US$224.04 million) in overseas markets by June 2017.[195]"
        },
        {
          "type": "paragraph",
          "text": "India"
        },
        {
          "type": "paragraph",
          "text": "Dangal collected ₹29.8 crore on its opening day of release in India, and recorded as the second highest non-holiday opening after Dhoom 3.[196][197] On its second day, the film collected ₹348 million (US$5.18 million) and on the third day collections were ₹424 million (US$6.31 million) taking the first weekend collections to ₹1.07 billion (US$15.92 million).[citation needed] On 9 January 2017, Dangal became the highest grossing Indian film domestically, beating Aamir Khan's previous film PK.[198] It eventually grossed ₹538.03 crore (US$80.07 million) from all languages in India.[175] The film's footfalls at the domestic Indian box office was 37 million admissions.[166]"
        },
        {
          "type": "paragraph",
          "text": "Overseas"
        },
        {
          "type": "paragraph",
          "text": "Deadline Hollywood reported that Dangal would open in 331 North American screens, the hitherto highest for a Bollywood film, on 21 December 2016.[199] Releasing in 279 theatres in the United States, it collected US$282,280 and US$42,816 from 24 theatres in Canada on the first day; an overall occupancy of 65 per cent was reported.[200] It grossed US$12.4 million in North America becoming the highest grossing Indian film there, to be surpassed only months later by Baahubali 2: The Conclusion.[201][202] Dangal was released in 95 screens across the Arab Gulf countries and was last reported to have collected ₹59.04 crore (US$8.79 million) from the region.[203]"
        },
        {
          "type": "paragraph",
          "text": "In the United Kingdom, the film grossed £2.6 million in December 2016,[172] and $4 million (₹27.23 crore) by January 2017.[173] It was the UK's highest-grossing foreign-language film of 2016, as well as the highest-grossing film in the category of specialised films (foreign-language, documentary and classic films).[172] It also received the highest opening in Australia for a Bollywood film (41 screens), and collected US$528,000 in its first weekend, opening at second spot, behind Rogue One.[204] Having collected over ₹12.65 crore (US$1.88 million) in the country,[c] it became the highest grossing Indian film there.[207] It also collected US$460,000 (₹2.98 crore) in New Zealand.[208]"
        },
        {
          "type": "paragraph",
          "text": "Dangal emerged as highest-grossing Indian film of all time in international markets, when it had grossed around ₹1,459 crore (US$224.04 million) overseas by June 2017,[195] during its second overseas phase, while running in Taiwan and China.[158][161][209][210]"
        },
        {
          "type": "paragraph",
          "text": "Taiwan"
        },
        {
          "type": "paragraph",
          "text": "Upon theatrical release in Taiwan, Dangal earned over US$3 million and emerged as the number one film there, also becoming the highest grossing Indian film in the region.[211][212] Its final gross in Taiwan was NT$167 million as of October 2017,[180] or ₹41 crore (US$6.3 million).[213] The film ran in the country for four months, with a final gross 101 times greater than its opening day gross, setting a record at Taiwan's box office.[181]"
        },
        {
          "type": "paragraph",
          "text": "China"
        },
        {
          "type": "paragraph",
          "text": "In China, a nation where Indian films were rarely shown, it became the highest grossing Indian film. It was initially released in six Chinese cities and on Youku under the Chinese title 摔跤吧!爸爸 (pinyin: Shuāijiāo ba bàba, \"Let's Wrestle, Father\").[214][215] It grossed US$2.48 million on opening day,[216] and grossed $14.5 million in just three days from theatrical release.[217] The collections totalled to ₹300 crore at the end of day nine from release, taking the overall collections past ₹1,000 crore, becoming the first Indian film to reach the mark.[218][219]"
        },
        {
          "type": "paragraph",
          "text": "In its second week, it emerged as the number one film in the country,[220][221] outselling Guardians of the Galaxy Vol. 2 by US$15 million according to China's film ticketing portal Maoyan.[222] In the process, it beat the record held by the 2016 Japanese anime film Your Name for the highest grossing foreign-language non-Hollywood film in China.[223] It held the number one position for the second consecutive week taking the overall collections past ₹1,500 crore.[224] As the film neared its one-month run, it had a cumulative gross equal to 70 times its opening day figure, breaking the record set by Zootopia (2016), following which the Chinese government gave the film a \"rare extension\" beyond the typical 30-day window.[225][226] As of 4 July 2017, Dangal had a cumulative China gross 87 times its opening day haul and 15 times its debut weekend, having been number one for 16 consecutive days and in the top three for 34 straight days, and out-lasting and out-grossing heavily marketed Hollywood movies such as Guardians of the Galaxy Vol. 2, King Arthur: Legend of the Sword, Life, Pirates of the Caribbean: Dead Men Tell No Tales, Wonder Woman and Alien: Covenant.[227] When its worldwide gross reached ₹1,930 crore on 11 June 2017, it became the fifth highest-grossing non-English film of all time.[24]"
        },
        {
          "type": "paragraph",
          "text": "As of July 2017, Dangal has grossed about ¥1.3 billion ($202 million) in China.[228][229] Its overseas gross in China more than doubled its domestic gross in India.[24] In China, Dangal became one of the top 20 highest-grossing films of all time,[228] the 8th highest-grossing foreign film,[230][231] had the most consecutive days with a ¥10 million ($2 million) gross (surpassing the 30 days of Transformers: Age of Extinction)[232] and $1 million gross[231] (38 days),[233] was the highest-grossing film in May 2017 (ahead of Pirates of the Caribbean: Dead Men Tell No Tales[234] and Guardians of the Galaxy Vol. 2),[193] and is the year's second highest-grossing foreign film (after The Fate of the Furious).[235] In the month of May, Dangal drew 35 million viewers at the Chinese box office.[236] In 52 days, the film had 44,897,623 admissions at the Chinese box office.[179] Khan's earnings from Dangal were estimated to be ₹300 crore (US$46.07 million),[237] one of the highest paydays for a non-Hollywood actor.[238] By the end of its run in China, its final gross there was ¥1,299.18 million,[178] equivalent to $216.2 million[28] (₹1,400 crore).[239] This was about 86 times its opening day gross, a record in China's box office history.[240]"
        },
        {
          "type": "paragraph",
          "text": "Turkey and Hong Kong"
        },
        {
          "type": "paragraph",
          "text": "In Turkey, where the film released on 18 August 2017, Dangal grossed US$428,201 as of 15 October 2017.[189]"
        },
        {
          "type": "paragraph",
          "text": "Dangal released in Hong Kong on 24 August 2017,[241] and grossed HK$5.2 million (₹4.26 crore) in its opening weekend including previews.[242] It opened at number-two at the Hong Kong box office in its first day, before rising to the top spot the following day.[243] It held onto the top spot at the Hong Kong box office through to the week ending 17 September 2017.[244] It surpassed the US$3 million milestone of Aamir Khan's previous hit 3 Idiots (2009) to become the highest-grossing Indian film ever in Hong Kong, where Dangal grossed HK$24.57 million (US$3.15 million, ₹20.42 crore) as of 26 September 2017.[245] By 2 October 2017, the film had grossed HK$25,430,761, equivalent to ₹21.31 crore (US$3.27 million).[246] As of 10 October 2017, the film has grossed ₹23.1 crore (US$3.5 million) in Hong Kong.[184] On its eleventh weekend, the film's gross in the city-state reached about HK$27 million, as of 6 November 2017.[247] The film has grossed HK$27,139,998 in Hong Kong, as of 19 January 2018.[183]"
        },
        {
          "type": "paragraph",
          "text": "Japan and South Korea"
        },
        {
          "type": "paragraph",
          "text": "In Japan, where the film released on 6 April 2018, Dangal has grossed ¥50 million, equivalent to ₹3 crore (US$438,663.83), as of 22 April 2018.[190]"
        },
        {
          "type": "paragraph",
          "text": "In South Korea, prior to release, the film was number-four at the box office on 24 April 2018, from preview screenings which grossed ₩154.41 million[248] (US$144,443).[187] On opening day, 25 April 2018, the film had grossed ₩220 million[249] ($205,800).[187] It opened at number-three, behind Hollywood film Avengers: Infinity War and domestic Korean film Intention.[249] In eight days, Dangal grossed ₩415.412 million,[250] equivalent to $389,000[187] (₹2.88 crore). In 15 days, the film grossed ₩564 million,[251] equivalent to $528,000[187] (₹3.91 crore). As of September 2018, the film has grossed ₩906.42 million,[186] equivalent to $850,000[187] (₹6 crore)."
        },
        {
          "type": "paragraph",
          "text": "Commercial analysis"
        },
        {
          "type": "paragraph",
          "text": "India"
        },
        {
          "type": "paragraph",
          "text": "Despite the hype created by the film prior to its release, it was not expected to perform very well on two accounts. Khan's comment in November 2015 during the ongoing intolerance debate in India had sparked outrage and backlash from certain sections of right wing extremist groups. Despite his clarification that the statement made was taken out of context and publicised, the criticism, primarily on social media, continued to the extent that prior to the film's release, campaigns calling for boycotting the film began, on grounds that Khan was \"anti-national\".[252][253] Secondly, after the government of India demonetised India's banknotes in November 2016, film businesses drastically fell as tickets were paid for mostly in cash, more so in the 8,500 single screen theatres of a total of 12,000, which accounted for 45 per cent of the total box-office revenue in India. Following the exercise, it was reported that business fell by 60 per cent and that 700 theatres even shut,[254] including a few that deciding not to renew their licences, converted into wedding halls. The earnings of films Dear Zindagi, Kahaani 2: Durga Rani Singh and Befikre that were released around this time were significantly affected, and their corresponding producers had handed out limited prints to single-screen theatres, to keep losses at a minimum.[255]"
        },
        {
          "type": "paragraph",
          "text": "However, that neither of the two affected the performance of Dangal was evident in how quickly the online ticketing platform BookMyShow hit its fastest one million tickets booked before the release. An average occupancy of over 60 per cent was reported on the first few days in multiplexes.[256] The film performed well on single-screen theatres as well that saw a surge, after two consecutive years of fall in business accentuated further by the demonetisation exercise.[257][258] The film proved to be an end to the \"dry spell\" to cinemas across India.[259] On 25 December, its third day from release, it earned ₹42.35 crore in India, setting a record for the highest ever single-day earning.[260] After strong performance over its first two weeks, it emerged as the highest-grossing Indian film beating PK over its third weekend.[261]"
        },
        {
          "type": "paragraph",
          "text": "China"
        },
        {
          "type": "paragraph",
          "text": "Dangal performed particularly well in China. This was attributed partly to Khan's popularity in China owing to the success of his previous films 3 Idiots (2009) and PK (2014) there.[262] When 3 Idiots released in China, the country was only the 15th largest film market, partly due to China's widespread pirate DVD distribution at the time. However, it was the pirate market that introduced 3 Idiots to most Chinese audiences, becoming a cult hit in the country. It became China's 12th favourite film of all time, according to ratings on Chinese film review site Douban, with only one domestic Chinese film (Farewell My Concubine) ranked higher. Khan gained a large growing Chinese fanbase as a result. By 2013, China grew to become the world's second largest film market (after the United States), paving the way for Khan's Chinese box office success, with Dhoom 3 (2013), PK, and eventually Dangal.[263] His TV show Satyamev Jayate also had a cult following in China, establishing Khan as someone associated with quality films and committed to social causes.[264]"
        },
        {
          "type": "paragraph",
          "text": "It was also reported that Chinese audiences could relate to the underlying social theme of Dangal in that it portrayed the success story of sisters in the backdrop of a patriarchal and gender inequal society, much like the conditions inherent in China.[265] Another factor was that the film filled a \"vacuum\" created by lack of interest among filmgoers due to \"poor quality of domestic films\" and China's ban on the \"wildly popular\" Korea dramas on television and streaming platforms due to South Korea's acceptance of the deployment of the American THAAD missile defence system, in August 2016.[266][267] On the day of its release, 5 May 2017, Dangal had a screen share of 13.3 per cent with 30,000 screenings,[268] much lower than Guardians of the Galaxy Vol. 2, (43.9 per cent), the number one film for the previous week. On its fourth day, the first Monday, it rose to 17.7 per cent, and an occupancy rate of over 33 per cent was reported, as against a highest of 24.7 per cent for Guardians of the Galaxy Vol. 2. Immediately after, aided by word-of-mouth publicity,[269] people reportedly thronged the theatres, and screenings were increased to 35,000 on the second Saturday and 55,000 the following day.[270] During the time, the film began trending in Sina Weibo,[110] where the hashtag #摔跤吧爸爸# (#LetsWrestleDad, the film's Mainland Chinese title) has been mentioned over 470 million times.[271][272] The run continued into its third week with 2.7 million tickets sold on the Sunday.[224] With 27 per cent share in ticket sales, it was the highest earning film in China for the month.[273]"
        },
        {
          "type": "paragraph",
          "text": "According to Chinese media, Dangal is one of the highest-rated films on Chinese film sites Douban[274][275] and Maoyan,[276] which helped the film generate strong word of mouth.[277] The film's word of mouth was also helped by discussion generated on Chinese social media sites such as WeChat and Sina Weibo, including discussion surrounding Khan's previous work in film and television, as well as a number of prominent Chinese celebrities recommending Dangal to their fans, including stars such as Deng Chao, Wang Baoqiang, Yao Chen, Feng Xiaogang, Lu Han and Fan Bingbing.[264] According to Maoyan, the film's audiences were 59% female and 41% male, and the majority were in the 20–34 age group.[278]"
        },
        {
          "type": "paragraph",
          "text": "Since Dangal's release in May 2017 through to October 2017, it has significantly out-grossed nearly every Hollywood film released in China during that time, with the only exception being Transformers 5. The big-budget Hollywood films that Dangal out-grossed include Guardians of the Galaxy Vol. 2, Pirates of the Caribbean: Dead Men Tell No Tales, Wonder Woman, The Mummy, Alien: Covenant, Despicable Me 3, Dunkirk, Valerian and the City of a Thousand Planets, Spider-Man: Homecoming, War for the Planet of the Apes, The Hitman's Bodyguard, and even The Foreigner starring Jackie Chan.[279] Dangal also surpassed the China gross of Captain America: Civil War (2016).[230] According to The Beijinger: \"In this atmosphere of poor Chinese films, Hollywood franchise fatigue and an ongoing ban on South Korean entertainment, Dangal has made the most of its opportunity to win over the Chinese film market.\"[236] Its gross in China is notably higher than the gross of any non-English foreign film released in North America, where the highest is Crouching Tiger, Hidden Dragon (2000) with $128 million."
        },
        {
          "type": "paragraph",
          "text": "Impact"
        },
        {
          "type": "paragraph",
          "text": "Dangal, along with Japanese anime film Your Name (which Dangal overtook as the highest-grossing foreign film), began a new trend at the Chinese box office, with Chinese audiences slowly moving away from Hollywood blockbusters and taking more interest in films from other countries, such as Thailand's Bad Genius and Spain's Contratiempo.[300] As of 5 November 2017, non-Hollywood imports account for 72 per cent ($519.7 million) of the year's foreign film box office revenue so far (US$723 million), with Dangal alone accounting for 27 per cent.[301] An EntGroup survey in China found that the preference for Hollywood films declined from 61 per cent in 2016 down to 55 per cent in 2017, as Chinese audiences increasingly develop preferences for Chinese, Indian and Japanese films.[302]"
        },
        {
          "type": "paragraph",
          "text": "Dangal, along with Khan's next blockbuster Secret Superstar, drove up the buyout prices of Indian film imports for Chinese distributors.[303] The success of Dangal and Secret Superstar contributed towards Salman Khan's Bajrangi Bhaijaan (2015) securing a wide release in China,[304] along with Irrfan Khan's Hindi Medium (2017) getting a release in the country,[305] followed by a number of other Indian films in 2018."
        },
        {
          "type": "paragraph",
          "text": "The film has also had an impact on Chinese cinema. The film's success has led to Chinese filmmakers becoming more confident in tackling social realist themes concerning Chinese society.[300] The film's influence can be seen in the 2018 blockbuster Dying to Survive, for example.[306]"
        },
        {
          "type": "paragraph",
          "text": "Dangal has had a political impact, with the film being screened at the Indian parliament in a bid to spread the message of women empowerment.[307] It has also had an effect on China–India relations, with Chinese leader and CCP general secretary Xi Jinping saying he enjoyed the film when he met Indian prime minister Narendra Modi.[308] The film resonated with Chinese audiences, with Diangying Yishu (Film Art) magazine stating, \"It is like the story of a Chinese village girl becoming an Olympic champion.\"[309]"
        },
        {
          "type": "paragraph",
          "text": "Several critics have noted that the Academy Award nominated American film King Richard (2021) starring Will Smith has a similar premise and plot to Dangal.[310][311][312]"
        },
        {
          "type": "paragraph",
          "text": "Controversies"
        },
        {
          "type": "paragraph",
          "text": "Political controversies"
        },
        {
          "type": "paragraph",
          "text": "There was political controversy upon Dangal's release in India. In November 2015, Khan expressed the feelings that he and Kiran had about growing intolerance in India,[313][314] which led to Khan facing intense backlash for the comments,[314][315] including violent threats.[316][317] As part of continued backlash against Khan's comments, there were calls for protests and boycotts against Dangal. In October 2016, the Vishva Hindu Parishad (VHP) called for protests against the film.[318] Following its release in December 2016, #BoycottDangal was trending on Twitter,[319][320] and BJP general secretary Kailash Vijayvargiya called for protests against the film.[321]"
        },
        {
          "type": "paragraph",
          "text": "There was also controversy over its release in Pakistan. In response to the Indian Motion Picture Producers Association (IMPPA) banning Pakistani film artists and technicians from working in Indian films, Pakistani theatre owners and exhibitors responded by temporarily putting a stop to screening Indian films. Due to Khan's popularity, however, Dangal was set to release in Pakistan, but the Central Board of Film Censors demanded that scenes featuring the Indian flag and Indian national anthem be omitted. Khan refused, and thus the film was not released in Pakistan, where it was predicted to gross up to ₹12 crore (US$1.79 million).[322]"
        },
        {
          "type": "paragraph",
          "text": "Award controversies"
        },
        {
          "type": "paragraph",
          "text": "At the 64th National Film Awards in 2017, there was controversy over the National Film Award for Best Actor, which the committee awarded to Akshay Kumar for his performance in Rustom,[323][324] instead of Aamir Khan's performance for Dangal.[325][326][327] Committee member Priyadarshan, who has worked with Kumar on several films,[323][327] gave the following explanation for awarding Kumar instead of Khan:[327]"
        },
        {
          "type": "paragraph",
          "text": "Why should we have given the Best Actor award to Aamir Khan when he has made it very clear that he doesn't attend awards functions? If he doesn't want to accept the honour, what is the point in honouring him? Nowadays, we have seen people returning their awards. We didn't want to take that risk."
        },
        {
          "type": "paragraph",
          "text": "Similarly, Dangal was not awarded at the 18th IIFA Awards, where Kumar was also not awarded. According to the IIFA Awards organisers:[328]"
        },
        {
          "type": "paragraph",
          "text": "So basically, in IIFA, forms are sent to various production houses. They fill those forms up and send it back to us. Those forms are then put out to the industry for voting and from there it becomes a nomination. So, Dangal has not sent their entry in. We would love Dangal to be a part of it. I think it's a movie that's broken all records. We love Aamir Khan and the two little girls. They did a great job. But unfortunately, they didn't send their entry in."
        },
        {
          "type": "paragraph",
          "text": "3 Idiots"
        },
        {
          "type": "paragraph",
          "text": "3 Idiots is a 2009 Indian Hindi-language coming-of-age satirical comedy-drama film written, edited and directed by Rajkumar Hirani, co-written by Abhijat Joshi and produced by Vidhu Vinod Chopra. The film stars Aamir Khan, R. Madhavan and Sharman Joshi in the title roles, while Kareena Kapoor, Boman Irani, Mona Singh and Omi Vaidya play supporting roles. Narrated through two parallel timelines, one in the present and the other set ten years earlier, the story follows the friendship of three students at an Indian engineering college and is a satire about the intrinsic paternalism under the Indian education system.[5][6][7]"
        },
        {
          "type": "paragraph",
          "text": "Adapted loosely from Chetan Bhagat's novel Five Point Someone,[8] It is produced by Chopra under the banner Vinod Chopra Films,[9][10] 3 Idiots incorporated real Indian inventions created by Remya Jose,[11] Mohammad Idris,[12] Jahangir Painter[13] and Sonam Wangchuk, the latter of whom also inspired Khan's character.[14]"
        },
        {
          "type": "paragraph",
          "text": "Upon its release on 24 December 2009, 3 Idiots received widespread critical acclaim with praise directed towards its direction, themes, humour, story, screenplay, soundtrack and performances of the cast. It was also the highest-grossing film in its opening weekend in India, had the highest opening day collections for an Indian film up until that point, and also held the record for the highest net collections in the first week for a Hindi film. Eventually, it became one of the few Indian films at the time to become successful in East Asian markets such as China[15] and Japan,[16] eventually bringing its worldwide gross to ₹460 crore ($90 million)[a][17][18] — it was the highest-grossing Indian film ever at the time until 2013, when Dhoom 3 surpassed it."
        },
        {
          "type": "paragraph",
          "text": "At the 57th National Film Awards, 3 Idiots won three awards, including Best Popular Film Providing Wholesome Entertainment. Additionally, it won a leading 6 awards at the 55th Filmfare Awards (tying with Dev.D), including Best Film, Best Director (Hirani) and Best Supporting Actor (Irani). Overseas, it won the Grand Prize at Japan's Videoyasan Awards,[19][20][16] while it was nominated for Best Outstanding Foreign Language Film at the Japan Academy Awards[21][22] and Best Foreign Film at China's Beijing International Film Festival.[23]"
        },
        {
          "type": "paragraph",
          "text": "3 Idiots is considered to be among the greatest Indian films ever made.[24] The film also had a social impact on attitudes toward education in India,[25] as well as in other Asian countries such as China and South Korea[6] and a huge cult following for its relevance and humour. It was remade in Tamil as Nanban (2012), which also received critical praise and commercial success.[26][27] A Mexican remake, 3 Idiotas, was also released in 2017.[28]"
        },
        {
          "type": "paragraph",
          "text": "Plot"
        },
        {
          "type": "paragraph",
          "text": "Chatur Ramalingam, a successful vice president, reminds his old college rivals Farhan Qureshi and Raju Rastogi of a bet he made ten years earlier with their classmate, friend, and Chatur's nemesis, Ranchoddas “Rancho” Shamaldas Chanchad. Chatur has returned to India to close a deal with famous inventor Phunsukh Wangdu. The trio head to Shimla to find Rancho, recalling their days at the Imperial College of Engineering (ICE) in Delhi."
        },
        {
          "type": "paragraph",
          "text": "At ICE, Rancho was an unconventional student passionate about learning. He often clashed with the strict director, Dr. Viru “Virus” Sahastrabuddhe, who valued rote discipline over curiosity. When a classmate, Joy Lobo, is denied graduation for missing a project deadline and takes his own life, Rancho blames Virus’s pressure-filled system. Virus dismisses him and later threatens to expel Farhan and Raju for associating with Rancho. That night, the trio visit Farhan and Raju’s homes and witness the hardships driving each friend’s choices."
        },
        {
          "type": "paragraph",
          "text": "After leaving Raju’s house, they accidentally crash Virus’s daughter Mona’s wedding reception, where they meet Mona’s sister Pia. Virus warns Farhan and Raju to stay away from Rancho, so Raju moves in with Chatur, a competitive student who memorizes textbooks without understanding. When Chatur prepares a Hindi speech for Virus and the Education Minister, Rancho and Farhan secretly replace words with obscene phrases, humiliating Chatur and sparking a ten-year challenge to see who will succeed in life."
        },
        {
          "type": "paragraph",
          "text": "Before the semester exams, Raju’s father suffers a stroke. Rancho and Pia rush him to the hospital, saving his life. In the subsequent semester exams, Farhan and Raju are at the bottom of the class while Rancho shockingly tops the class. This continues for the next four years. During a speech Virus, mockingly bets that Farhan and Raju will never get jobs. That night Rancho helps his friends face their fears—encouraging Farhan to pursue photography and Raju to gain confidence. They promise to act on their dreams if Rancho confesses his love to Pia."
        },
        {
          "type": "paragraph",
          "text": "Drunk and mischievous, they sneak into Virus’s home. Rancho professes his feelings to Pia while Raju urinates on Virus’s letterbox. When Raju is caught, Virus demands he betray Rancho or be expelled. Unable to choose, Raju attempts suicide and is hospitalized but survives. Moved, Virus reinstates him. Later, Raju earns a job offer, and Farhan persuades his father to let him become a photographer."
        },
        {
          "type": "paragraph",
          "text": "Determined to humble Rancho’s friends, Virus sets an impossibly hard exam so Raju will fail and lose his job. With Pia’s help, Rancho and Farhan steal the paper, but Raju refuses to cheat. They are caught and expelled. Subsequently, Pia confronts her father, revealing that her brother’s death was actually a suicide, rather than from a train accident, which was caused by Virus’s academic pressure, by showing a suicide note written by him."
        },
        {
          "type": "paragraph",
          "text": "That night, a storm cuts off power as Mona goes into labor. Rancho organizes an emergency delivery using college equipment while Pia guides him over video. The baby survives, and a grateful Virus revokes their expulsion and gifts Rancho his prized Space Pen—signifying respect. Soon after graduation, Rancho disappears."
        },
        {
          "type": "paragraph",
          "text": "In the present, Farhan, Raju, and Chatur arrive in Shimla and find Rancho’s house. They meet the real Ranchoddas, a wealthy man’s son, who tells them that the “Rancho” they knew was actually Chhote, the gardener’s gifted child who studied under Ranchoddas’s name to earn a degree for him. He gives them Chhote's address in Ladakh. On the way, they crash Pia’s wedding and convince her to leave her fiancé Suhas Tandon and reunite with Rancho."
        },
        {
          "type": "paragraph",
          "text": "In Ladakh, they find Chhote teaching at a school he built for poor children, focusing on creativity instead of competition. He reunites with Farhan and Raju and agrees to marry Pia. When Chatur arrives for a business deal, he mocks Chhote for being just a teacher and snatches the Space Pen from him, until he learns that Chhote is actually Phunsukh Wangdu, the inventor he came to meet. Stunned, Chatur realizes he lost the bet, while the friends laugh as he chases them with the contract and Space Pen, ending their story with joy."
        },
        {
          "type": "paragraph",
          "text": "Cast"
        },
        {
          "type": "paragraph",
          "text": "Aamir Khan as Ranchhoddas \"Rancho\" Shamaldas Chanchad / Chhote / Phunsukh Wangdu, a carefree student who is a natural prodigy and a genius. He later becomes a famous entrepreneur and scientist, who teaches when he is not conducting research."
        },
        {
          "type": "paragraph",
          "text": "R. Madhavan as Farhan Qureshi, a student with a passion for photography, who studies engineering to appease his father. He is later revealed to be a successful wildlife photographer who has published books of photographs."
        },
        {
          "type": "paragraph",
          "text": "Sharman Joshi as Raju Rastogi, a student who attends ICE for the sake of ending his family's poverty and is afraid of failure. He now has a successful corporate job and became a wealthy person."
        },
        {
          "type": "paragraph",
          "text": "Kareena Kapoor as Pia Sahastrabuddhe, a successful doctor and Rancho's love interest, youngest daughter of Virus and Mona's younger sister."
        },
        {
          "type": "paragraph",
          "text": "Boman Irani as Dr. Viru \"Virus\" Sahastrabuddhe, the strict and controlling principal of ICE who only believes in a competitive cutthroat education system and rote studying."
        },
        {
          "type": "paragraph",
          "text": "Omi Vaidya as Chatur \"Silencer\" Ramalingam, a Uganda-born Puducherrian student, who believes in rote study and takes memory-enhancing pills, with the side effect of silent but smelly flatulence."
        },
        {
          "type": "paragraph",
          "text": "Mona Singh as Mona Sahastrabuddhe, elder daughter of Virus and Pia's elder sister"
        },
        {
          "type": "paragraph",
          "text": "Ali Fazal in a cameo appearance as Joy Lobo, a senior student who committed suicide because of Virus not letting him graduate"
        },
        {
          "type": "paragraph",
          "text": "Rahul Kumar as Manmohan a.k.a. \"Millimetre\""
        },
        {
          "type": "paragraph",
          "text": "Dushyant Wagh as a grown-up Manmohan a.k.a. \"Centimetre\" who becomes Rancho's (Phunsukh's) assistant at his school in Ladakh"
        },
        {
          "type": "paragraph",
          "text": "Parikshit Sahni as Farhan's father (dubbed \"Hitler Qureshi\"), a strict but a loving and caring father who ultimately only wants his son to be happy."
        },
        {
          "type": "paragraph",
          "text": "Farida Dadi as Farhan's mother"
        },
        {
          "type": "paragraph",
          "text": "Akhil Mishra as Librarian Dubey"
        },
        {
          "type": "paragraph",
          "text": "Amardeep Jha as Raju's mother (dubbed \"Mother Teresa\")"
        },
        {
          "type": "paragraph",
          "text": "Mukund Bhatt as Raju's paralysed father"
        },
        {
          "type": "paragraph",
          "text": "Olivier Sanjay Lafont as Suhas Tandon, Pia’s ex-fiance who only cares about money and status"
        },
        {
          "type": "paragraph",
          "text": "Rajendra Patwardhan as Govind"
        },
        {
          "type": "paragraph",
          "text": "Rajeev Ravindranathan as ragging senior student"
        },
        {
          "type": "paragraph",
          "text": "Jayant Kripalani as a company head who conducts Raju's job interview"
        },
        {
          "type": "paragraph",
          "text": "Chaitali Bose as Kammo, Raju's sister"
        },
        {
          "type": "paragraph",
          "text": "Javed Jaffrey as the real Ranchhoddas Shamaldas Chanchad"
        },
        {
          "type": "paragraph",
          "text": "Arun Bali as Shamaldas Chanchad"
        },
        {
          "type": "paragraph",
          "text": "Achyut Potdar as Machine Class Professor"
        },
        {
          "type": "paragraph",
          "text": "Madhav Vaze as Joy's father"
        },
        {
          "type": "paragraph",
          "text": "Production"
        },
        {
          "type": "paragraph",
          "text": "Development"
        },
        {
          "type": "paragraph",
          "text": "\"Chetan gave me this book to read and I wanted to make a film on it. But I knew right from the start that I could not make a film completely on the book, as it was very anecdotal and a film needs a plot. So I had decided to rewrite it in a screenplay format. You'll see that the film is very different from the book. After I wrote the script, I called Chetan and narrated it to him. I told him that if he did not like the script, I would stop the project. But he was okay with it\"."
        },
        {
          "type": "paragraph",
          "text": "— Rajkumar Hirani, about the connection with the film and the novel Five Point Someone by Chetan Bhagat[29]"
        },
        {
          "type": "paragraph",
          "text": "After the success of Lage Raho Munna Bhai (2006), the director Rajkumar Hirani and screenwriter Abhijat Joshi had plans for third instalment on the Munna Bhai franchise, titled Munnabhai Chale Amerika. But Hirani felt exhausted working on consecutive films on the same format, and decided to work on fresh script outside the franchise.[30] While writing the first draft of the film, he thought of a new project rather than the new instalment from the film series, but he had concentrated more on the project and then worked on the former first. While thinking about how the project coming under fruition, he got the popular novel Five Point Someone by the author Chetan Bhagat.[31] The latter gave this novel for Hirani to read, in order to have an idea about the script. Impressed by the novel, he decided to adapt the screenplay by making changes to the original novel and work on it as a feature film.[32]"
        },
        {
          "type": "paragraph",
          "text": "3 Idiots is considered to be the first of the two adaptations from the novel Five Point Someone — the second being Kai Po Che! (2013), which also drew inspiration from the novel The 3 Mistakes of My Life written by Bhagat.[33] In the third collaboration with Hirani after the Munna Bhai film series: Munna Bhai M.B.B.S. (2003) and Lage Raho Munna Bhai (2006), Vidhu Vinod Chopra produced the project under the production company Vinod Chopra Films (which earlier named Vinod Chopra Productions).[34] Besides producing, Chopra further associated with Hirani and Joshi, by co-writing the screenplay. In his biography Unscripted: Conversations on Life and Cinema, he discussed about the experiences as a co-writer being associated in the project.[34][35]"
        },
        {
          "type": "paragraph",
          "text": "An official announcement regarding the film was made during early-2008, after working in the script for more than one-and-a-half year.[36] During the pre-production, Hirani went to multiple engineering colleges, including those under the Indian Institutes of Technology in Mumbai and Delhi, to authenticate the lives of engineering students. He met many students and took pictures along with them. He needed the references for the clothes used, their looks and things they brought as many IIT-students were older than the fictional characters.[32] The film also had shared many anecdotes from his college life, since Hirani had used to study in hostel during his young period.[37] Hirani had carefully looked upon the notion in the lives of engineering students, as there are few things apart from drugs, sex and violence. However, Hirani had said that the film plays a satirical take on social pressures under an Indian education system.[6][7] Apart from that, the film also addresses the issue of tussle between parents and children, but in a \"sugar-coated manner\".[citation needed] During the promotions of the film, Hirani stated that \"the film is completely different of the Munna Bhai film series; in terms of the characters, story and the environment. However, both the films fall in the same genre, where all three films are heartwarming stories with lovable characters making it feel good. Both films have true emotions in the heart, happiness, sadness and also leave a strong message to the audience in the ending that make us satisfy\".[32]"
        },
        {
          "type": "paragraph",
          "text": "Casting"
        },
        {
          "type": "paragraph",
          "text": "The lead actors of 3 Idiots: Aamir Khan, R. Madhavan and Sharman Joshi (left to right)"
        },
        {
          "type": "paragraph",
          "text": "The casting of the lead actors was considered to be \"complex\", according to Hirani.[32] He thought of many actors playing the lead roles and also went on a six-month audition across the country, during which newcomers like Rajkummar Rao, Jacqueline Fernandez, Amruta Khanvilkar, Jitendra Joshi, Gurmeet Chaudhary and Pulkit Samrat also had auditioned.[38] Rohan Mapuskar, one of the casting directors, revealed that Khanvilkar was originally finalised for the role of Pia, and even her payment was discussed.[39] Meanwhile, Joshi was selected for Raju's role before the casting decisions were changed.[38] However, Hirani thought of established actors playing the roles, since the film had two looks and the actors needed experience.[32] He had plans for Shah Rukh Khan playing the lead character, Ranchoddas Chanchad.[40] Hirani tried to rope Khan after the latter exited from the titular role Munna Bhai in the director's debut venture Munna Bhai M.B.B.S. (2003), which was later essayed by Sanjay Dutt. However, Khan refused being a part of the film due to his prior commitments.[41] Ranbir Kapoor, then a relative newcomer, also declined the lead role, but agreed to a short cameo as Varun Sahastrabuddhe.[42][b] Hrithik Roshan also turned down the character.[45] Aamir Khan was later finalised to play the lead role.[46]"
        },
        {
          "type": "paragraph",
          "text": "R. Madhavan and Sharman Joshi were also finalised for the other two leads – Farhan and Raju.[47] Originally, the roles initially went to John Abraham and Saif Ali Khan, but the actors rejected the film due to date issues. Arshad Warsi, who also collaborated with Hirani in the two Munnai Bhai films, auditioned but could not take up the role.[47] Before R. Madhavan was cast, Bangalore-based Rajeev Ravindranathan shot for his character for two months before his scenes were removed in favour of casting a \"known face\". Ravindranathan later played a college senior.[48] On being questioned about casting older actors to play the titular college students, Hirani said in an interview to Rediff that \"the actors chosen have that quality which he wanted for the film apart from the body language, mannerisms and innocence portrayed on-screen\".[32]"
        },
        {
          "type": "paragraph",
          "text": "The team approached Sanjay Dutt, with whom Hirani worked in the Munna Bhai film series, to play the role of the main antagonist Dr. Viru Sahastrabuddhe, but for various reasons the role went to Boman Irani.[49] The character name was considered to be unique due to the look, lisp and mannerisms portrayed, and also got the nickname \"Virus\", as students give names to their professors and principals in their school and college life. For the preparation of his role, Boman wore costumes made of cheap fabric, designed by an old tailor who stitches clothes for Parsis in Dadar (North-Central Mumbai).[32] He wore the shirt with velcro attached, and a hook tie; with the same look, he attended the shoot to prepare for his role.[49] Initially, Boman was hesitant to act in that film and had recommended his co-actor Irrfan Khan for Viru Sahastrabuddhe, but his refusal prompted Boman to take up the role.[50] This was revealed by Boman after Khan's death in April 2020.[51]"
        },
        {
          "type": "paragraph",
          "text": "After talks with Kajol fell through,[52] Kareena Kapoor played the role of Pia Sahastrabuddhe, Rancho's (Aamir) love interest and a medical student.[32] While Hirani refused about the original casting for her role in the film in his interview,[32] it has been regarded that Anushka Sharma was originally considered for the role.[53] In April 2021, an old video of Anushka's audition for the film went viral on the internet.[54] Anushka, then a newcomer, shared monologues recited by Gracy Singh from Munna Bhai M.B.B.S. for the audition process, supposing to be her debut in films, but was ultimately rejected by the producers.[55] She later made her debut in the Yash Raj Films' production Rab Ne Bana Di Jodi (2008), being cast opposite Shah Rukh Khan.[b]"
        },
        {
          "type": "paragraph",
          "text": "Omi Vaidya, an American actor, was cast for the role Chathur Ramalingam (Silencer)\".[56]"
        },
        {
          "type": "paragraph",
          "text": "Ali Fazal, then, a rookie actor, played a small role as Joy Lobo in the film.[57] While speaking about his role, Fazal stated that \"he went into depression as the character arc seemed to mirror a tragic real-life incident\".[58][c]"
        },
        {
          "type": "paragraph",
          "text": "Javed Jaffrey played a cameo appearance as the real Ranchoddas Chanchad.[59]"
        },
        {
          "type": "paragraph",
          "text": "Filming"
        },
        {
          "type": "paragraph",
          "text": "The rehearsals for the film began prior to the shoot, followed by script reading and look tests.[60] After extensive pre-production works, principal photography for the film began on 28 July 2008, with scenes featuring the supporting cast being shot first.[61] On 29 August 2008, shooting for the key schedule began with the principal cast members.[36] The first scene was shot in an aircraft with Madhavan, which was the first shooting schedule for this film in Mumbai. The team left to Ladakh, for a 20-day schedule with the crew and cast comprising Khan and Kapoor.[36] The climax was being shot at the Pangong Tso lake in Ladakh.[62] The team took a break following Aamir Khan's activities in the promotions and post-production works of Ghajini (2008).[63]"
        },
        {
          "type": "paragraph",
          "text": "The Indian Institute of Management, Bangalore served as Imperial College of Engineering, for this film."
        },
        {
          "type": "paragraph",
          "text": "In December 2008, the entire cast and crew, including Khan, Madhavan, Joshi and Hirani, headed to Indian Institute of Management, Bangalore campus which served as Imperial College of Engineering. To prepare for the roles, the crew members stayed at the institution's dormitory blocks and at the college hostel.[64] Though Khan saw the pictures of the location, he decided to see the location for real and wanted to stay at the hostel, in order to get through the role.[65] Khan regularly met the students during the morning and evenings and shared the experiences of studies and way of life. Apart from that, the team eventually mingled with the students while Khan also involved in many indoor and outdoor games.[66] While shooting for the film, the team made extra precautions with none of the shooting process might affect the routine class sessions.[63] It was the first film to be shot at the Indian Institutes of Management Group, and the university granted an academic pay-off for itself.[67] After shooting being completed the makers will film a documentary on the institution.[67] Few parts in Bangalore were doubled as New Delhi for the film. The entire shooting process was completed within February 2009.[citation needed] The entire film was shot in reverse, with the present-day scenes being shot first and the college scenes were shot later.[47]"
        },
        {
          "type": "paragraph",
          "text": "C. K. Muraleedharan was the cinematographer for 3 Idiots, after collaborating with Hirani for Lage Raho Munna Bhai (2006). He used Arricam Lite (LT) camera for shooting the film, which consisted of Angenieux Optimo Anamorphic Lenses and Zeiss Master Prime Lenses, with the film had a distributed aspect ratio of 2.39:1.[citation needed] Rajkumar Hirani also undertook supervision of editing the film. For the scene where the leads get drunk and break in Virus' house, Aamir suggested that the actors might get drunk in reality so as to make it look convincing, but, however, the actors went on numerous retakes, which even led the stock of film roll being exhausted. The actors continued to do retakes, until the new rolls have been bought, so as to keep them busy.[68][69] The pregnancy scene was initially supposed to be placed in Hirani's debut film Munna Bhai M.B.B.S. (2003), but as he felt that the placement was irrelevant in the film, the team decided against doing so, and then was used in this film.[70] The hospital scenes were shot at Fortis Hospital (Noida).[47]"
        },
        {
          "type": "paragraph",
          "text": "The film uses real inventions, with brains behind these innovations include Remya Jose, a student from Kerala, who created the pedal operated washing-machine;[11][71][72] Mohammad Idris, a barber from Hasanpur Kalan in Meerut district in Uttar Pradesh, who invented a bicycle-powered horse clipper;[12] and Jahangir Painter, a painter from Maharashtra, who made the scooter-powered flour mill.[13] The character Phunsuk Wangdu drew inspiration from Ladakhi inventor Sonam Wangchuk, a mechanical engineering graduate from the National Institute of Technology, Srinagar.[14][73]"
        },
        {
          "type": "paragraph",
          "text": "Music"
        },
        {
          "type": "paragraph",
          "text": "Main article: 3 Idiots (soundtrack)"
        },
        {
          "type": "paragraph",
          "text": "The film's soundtrack is composed by Shantanu Moitra with lyrics penned by Swanand Kirkire. It marked Moitra's second consecutive collaboration with Rajkumar Hirani after Lage Raho Munna Bhai (2006), whose music album was successful.[74] Besides composing the songs, Moitra also composed the film score with Sanjay Wandrekar and Atul Raninga. The album was created with the inspiration of Moitra's college days, with the songs been written in consideration on the mindset of youngsters in India.[74]"
        },
        {
          "type": "paragraph",
          "text": "The album features five original compositions. Two tracks from the album were remixed, despite Moitra not liking the trend of remixing film songs.[75] Sonu Nigam rendered five out of seven tracks from the album. Other singers performing vocals to the songs are Shaan, Shreya Ghoshal, Suraj Jagan, the lyricist Kirkire and composer Moitra themselves, recording for the soundtrack. One of the tracks \"Give Me Some Sunshine\" was sung by one of the lead actors, Sharman Joshi, in his maiden attempt in playback singing. The music album was released online (instead of a launch event),[76] by the film's official website on 27 November 2009,[77] with a video chat featuring the cast and crew members.[78] T-Series purchased the music rights of the film at an amount of ₹120 million (US$2.48 million).[79][80]"
        },
        {
          "type": "paragraph",
          "text": "The album received positive reviews from critics, with praise directed towards Moitra's composition and the quality of the album. In addition, the soundtrack became the highest-selling Bollywood soundtrack of 2009, according to the trade website Box Office India, despite the sales of conventional music CDs being declined.[81] Due to the internet boom, it became the \"most downloaded Bollywood music album of the year\".[82] \"Aal Izz Well\" was listed as one of the \"Top 10 Bollywood Songs of 2009\" and became a sensation among the youngsters.[83][84] The soundtrack further fetched a number of accolades is considered as one of Moitra's best albums, along with Parineeta (2005) and Lage Raho Munna Bhai (2006)."
        },
        {
          "type": "paragraph",
          "text": "Release"
        },
        {
          "type": "paragraph",
          "text": "Statistics"
        },
        {
          "type": "paragraph",
          "text": "3 Idiots released on 25 December 2009 over 1550 prints and 1760 screens in India,[85] which was considered to be a \"wide domestic release for a Bollywood film\" at that time, according to trade analysts.[86][87] Major multiplexes allotted more than 95% of screens for the film, prior to the release.[88] It also had a wide-overseas release with about 344 prints in 415 screens.[89] However, Bollywood Hungama and The Times of India reported that the film had got about 342–366 screens.[90][91] The film's wide-release in about 32 countries was noted by trade analysts, who wondered whether it would slow down the business of James Cameron's Avatar (2009), which was breaking box-office records.[91] Producer Vinod Chopra said that a multiplex in Australia reduced the shows for Avatar, so that it could play 3 Idiots.[88][92]"
        },
        {
          "type": "paragraph",
          "text": "Following its domestic success, 3 Idiots was screened in East Asian markets. It was released in Taiwan on 17 December 2010,[93] followed by Hong Kong on 1 September 2011[94][95] and mainland China on 15 December 2011.[96] In South Korea, it was released on 29 December 2011.[7] Along with the original Hindi version, a Mandarin Chinese–dubbed version was also released, with Tang Wei voicing Pia,[97] and Huang Bo voicing Rancho.[98] In January 2013, the film was distributed by Apex Entertainment and CJ Entertainment to release the film in the Korean markets and was released on 25 January 2013.[99] Following its success in other Asian markets, Japanese distributor Nikkatsu announced plans to release the film in Japan.[100] It was released there in June 2013,[16] under the Japanese title Kitto, Umaku Iku (きっと、うまくいく; lit. \"It'll go well\").[101]"
        },
        {
          "type": "paragraph",
          "text": "Screenings"
        },
        {
          "type": "paragraph",
          "text": "In November 2009, Aamir Khan invited hundreds of people to watch the first half of the film exclusively in a basis of Non-disclosure Agreement. 3 Idiots, thereby being the first film in Bollywood to use this clause, which was prevalent in Hollywood; the lead actor asked people to share the opinions about the film.[102] The premiere show for the film was held in Mumbai on 23 December 2009.[103] Along with the film's cast and crew, the event saw the presence of Anil Kapoor, Yash Chopra, Karan Johar, Shah Rukh Khan, Salman Khan and Saif Ali Khan among many others[104][105] and other named celebrities, including Hirani's earlier collaborators such as Sanjay Dutt, Vidya Balan, Arshad Warsi and Dia Mirza.[106] Amitabh Bachchan who had earlier confirmed his presence at the premiere ultimately did not turn up in the end. The special premiere in United States and Canada were held on 24 December, prior to the Indian release.[91] On 30 January 2010, a special screening of the film was conducted to the veteran actor Dilip Kumar.[107] He constantly followed the news of the film and wanted to watch it in a theatre, but due to his health condition, he could not get out of his home. Later, Chopra and Hirani expressed Dilip's wish and agreed to conduct a private screening for the actor.[107] Chopra said that he \"really moved after seeing the film and felt nostalgic\".[107] Later, he urged to discuss about the film and its making with Chopra and Hirani at the former's apartment in Bandra, with the discussion went on for two hours.[107]"
        },
        {
          "type": "paragraph",
          "text": "On 19 May 2010, the film was screened at the Headquarters of the United Nations in New York, with Rajkumar Hirani and the film's team attending the screening.[108] The members of the United Nations, came in touch with the producer regarding the screening of the film, following its influence in youngsters about the Indian education system.[109][110] More than 700 invitees, including non-Indians, turned up for the screening, despite the hall had capacity for about 600-650 people.[111] A two-hour long post-screening session was conducted to the attendees to focus on \"how the film has impacted mindsets\".[111] The film was screened at the Indian Film Festival of Melbourne in March 2010, to bridging the cultural gap between India and Australia, following the Violence against Indians in Australia during late-January 2010.[112] It may also help Bollywood markets to screen their film in Australia.[113][114] The film was screened at the Aruba International Film Festival held on 10 June 2010.[115][116]"
        },
        {
          "type": "paragraph",
          "text": "At the Indian Film Festival of London, held during 25–29 August 2010, the film was screened along with Chopra's other five films — An Encounter with Faces (1978); Parinda (1989); 1942: A Love Story (1993) and Eklavya: The Royal Guard (2007), while further honouring an award for Chopra.[117] A charity screening of the film was also held with the proceedings being contributed to UNICEF.[117][118] At the inauguration of Vidhu Vinod Chopra film festival, to honour the director-producer, 3 Idiots along with the director's other films, Eklavya: The Royal Guard, Mission Kashmir and the Munna Bhai film series, were screened at the festival on 30 March 2012.[119] 3 Idiots became one of the few Indian films screened at the inaugural Indian Film Festival held in Ho Chi Minh City (Vietnam) in December 2015.[120] The film was further screened at the inaugural Himalayan Film Festival held during 24–28 September 2021 in Ladakh.[121]"
        },
        {
          "type": "paragraph",
          "text": "Marketing"
        },
        {
          "type": "paragraph",
          "text": "Aamir Khan used innovative marketing strategies for the promotions of the films, in order to gain wide exposure among audience.[122] Anil Arjun, the CEO of Reliance MediaWorks which produced and distributed the film had stated that, a 40-member team was put in place to market the film four months prior to the release. He said that \"the campaign was made such a way that it appeals to all category of viewers — people who are going to multiplexes in metros and single screens in small towns\". The film was shown to all stakeholders and the company employees prior to the release, and a 360-degree marketing campaign was made after the release, which covered digital, outdoor, brand partnerships, public relations and merchandise.[123]"
        },
        {
          "type": "paragraph",
          "text": "The \"butt chairs\" used by the actors in the film, were placed at leading multiplex chains for public viewing.[124] The makers teamed up with Zapak.com for digital promotions,[125] with firstly the official website titled idiotsacademy.com was launched and the lead cast came with video chatting to the fans.[124] The website designed keeping in mind the college atmosphere and few special added features.[122] The team later interacted with fans through video conference during the online music launch.[78] A two-promotional tour was conducted by Khan, where he would travel across India.[122] On the website, an alternate reality game called \"Track Aamir\" was launched, to track the whereabouts of the actor during this tour. The site had over 600,000 unique visitors within two weeks.[123] During this tour, Aamir Khan invited 24 friends personally to attend the premiere held in Mumbai, prior to the release of the film.[103] Prior to the release promos for the film was unveiled in an event attended by the lead actors and the crew associated in the film, and press conferences streamed in seven countries.[124] The online promos, trailer, video songs and interviews were released in YouTube.[124]"
        },
        {
          "type": "paragraph",
          "text": "Reliance Life Insurance started a campaign based on the song \"All Is Well\" and promoted it in television channels, radio stations and hoardings featuring the lead actors of the film.[123] The makers started marketing alliances with Pantaloons Fashion and Retail, to launch their exclusive apparel and accessories collection. The special T-shirts with Khan's scribblings as designs imprinted on it, was available in 45 Pantaloons stores, which were priced ₹399.[123] The collection also included replicas of T-shirts, garments and jewellery used by the leads in the film.[124] As a part of promotions in Facebook, the handle called \"Pucca Idiot\" was launched prior to the release, which generated 10,000 followers within 24 hours.[123] In PVR Cinemas, the film's marketing team painted on washrooms, with the slogan \"You are an idiot\".[123] Another promotional event titled \"Sabse Big Idiot\" was held, with the leads being present at 92.7 Big FM, asking viewers to show their idiocy.[126] As a part of outdoor promotions, carried by Primesite Marketing Agency, innovations in hoardings, bus shelters, bus backs, platform signages and mobile vans attracted audiences. Stickers with the film's logo was pasted in 10,000 auto rickshaws that moved in cities.[124]"
        },
        {
          "type": "paragraph",
          "text": "Trade analysts believed that the unique promotional activity helped in the massive success of the box-office breaking several records, and also creating a nationwide impact.[123] At the Business Standard Brand Derby summit, held at the Leela Kempinski hotel in Gurgaon on 16 July 2010, the film topped the 2009 Brand Derby, due to the unique promotions of the film.[123][127]"
        },
        {
          "type": "paragraph",
          "text": "Piracy"
        },
        {
          "type": "paragraph",
          "text": "In addition to encourage people watching the film in theatres, Reliance MediaWorks' marketing team managed to destroy more than 2.1 million illegal downloads.[123] The team had its core-group working in India, United States and United Kingdom, tracked and destroyed pirated versions of the film in physical and online formats, and also issued trade notices, warning letters specific to prospective infringing sites and outlets across the overseas sectors.[123] On 26 December 2009, a day after the film's release, the social service branch conducted a raid near Bandra station and over 2500 pirated CDs and DVDs, with 69 DVDs of this film, along with other films Avatar and Paa, were seized.[128] In New Delhi, the sales of pirated DVDs of the film were stopped after a subsidiary company of Reliance Anil Dhirubhai Ambani Group (R-ADAG), levied a complaint to the officials to take actions against movie piracy.[129] After the raid conducted by the police in several locations across Mumbai, former IPS officer Aftab Ahmed Khan, said that \"We execute everything keeping the system in mind. We have the support of the local police so there is no question of going against the system. Piracy always existed in some form or the other. But we are getting the facts and figures only now as there are industry body who are working together to bring this menace in the forefront. To curb piracy in the long run we will have to constantly work towards means and ways to fight it.\"[130]"
        },
        {
          "type": "paragraph",
          "text": "Television and home media"
        },
        {
          "type": "paragraph",
          "text": "The television rights of the film were purchased by Sony Pictures Networks for ₹22 crore (US$4.54 million), which was the highest bid during that time.[131] The film made its television debut on 25 July 2010, with promotions for the television premiere cost ₹2.2 lakh (US$4,811.25) and had attracted 12 popular sponsors to market the film.[132] It drew an audience of 39 million viewers in India,[18] and had attracted a TVR of 13.1 at the metro cities Delhi, Mumbai and Kolkata and an overall TVR of 10.1 domestically.[133] The cumulative reach of the film was uplifted to 30.5%.[133] It also helped the broadcaster, Sony MAX to the third position among the general entertainment channels during that month.[134]"
        },
        {
          "type": "paragraph",
          "text": "On 27 August 2010, Reliance Big Entertainment launched the standard DVD and VCD editions of the film through Reliance Big Home Video. It was coincided at an event held during Grand Hyatt at Mumbai, with the presence of the cast and crew members and was broadcast live on Facebook and Twitter.[135] Later, on 1 October 2010, Reliance Big Home Video launched the premium version of the VCD and DVD, that included a 24-page sticker book and special \"idioticomic\" book, priced at ₹499.[136] It eventually sold 75,000–80,000 copies upon its launch, thereby generating a revenue of ₹30–40 million (US$400,000–530,000).[136] A month later, the special Blu-ray disc edition was launched on 5 November 2010.[137]"
        },
        {
          "type": "paragraph",
          "text": "In order to curb piracy, producer Chopra and Hirani stated that the film will be released and downloaded legally through YouTube on 25 March 2010, twelve weeks after its theatrical release.[138] It was attempted for the people who cannot afford to go to multiplexes or single screens, thereby 3 Idiots becoming the first Indian film to have a legal release on YouTube.[138] However, the film did not release as planned on that day due to copyright issues.[139] Officially, it was released on YouTube in May 2012, but its access has since been restricted.[140] However, it has been made available for online streaming on multiple platforms such as Netflix, Amazon Prime Video and Sony LIV.[141] Later as Reliance Big Pictures Vinod Chopra Films signed a deal with JioStar.[142][dead link]"
        },
        {
          "type": "paragraph",
          "text": "Reception"
        },
        {
          "type": "paragraph",
          "text": "3 Idiots received widespread critical acclaim upon release from both domestic and international critics, with praise directed towards its direction, themes, humour, story, screenplay, soundtrack and performances of the cast."
        },
        {
          "type": "paragraph",
          "text": "India"
        },
        {
          "type": "paragraph",
          "text": "Subhash K. Jha stated: \"It's not that 3 Idiots is a flawless work of art. But it is a vital, inspiring, and life-revising work of contemporary art with some heart imbued into every part. In a country where students are driven to suicide by their impossible curriculum, 3 Idiots provides hope. Maybe cinema can't save lives. But cinema, sure as hell, can make you feel life is worth living. 3 Idiots does just that, and much more. The director takes the definition of entertainment into directions of social comment\".[143] Nikhat Kazmi of The Times of India gave it four and a half stars and suggests that, \"The film is a laugh riot, despite being high on fundas [...] Hirani carries forward his simplistic 'humanism alone works' philosophy of the Munnabhai series in 3 Idiots too, making it a warm and vivacious signature tune to 2009. The second half of the film does falter in parts, especially the childbirth sequence, but it doesn't take long for the film to jump back on track.\"[144]"
        },
        {
          "type": "paragraph",
          "text": "Mayank Shekhar of the Hindustan Times gave the film three and a half out of five stars and comments that \"this is the sort of movie you'll take home with a smile and a song on your lips.\"[145] Taran Adarsh of Bollywood Hungama gave 3 Idiots four and a half out of five stars and states: \"On the whole, 3 Idiots easily ranks amongst Aamir, Rajkumar Hirani and Vidhu Vinod Chopra's finest films. Do yourself and your family a favour: Watch 3 Idiots. It's emotional, it's entertaining, it's enlightening. The film has tremendous youth appeal and feel-good factor to work in a big way.\"[146] Kaveree Bamzai of India Today gave 3 Idiots five stars and argues that \"it's a lovely story, of a man from nowhere who wanted to learn, told like a fairy tale, with the secret heart carrying its coded message of setting all of us free.\"[147]"
        },
        {
          "type": "paragraph",
          "text": "Sonia Chopra of Sify gave the film 3 stars and said \"Though a bit too calculated and designed, 3 Idiots is still an ok option for the significant message, interesting cast and scattered breezy moments.\"[148] Rajeev Masand of CNN-IBN gave the film three out of five stars and states: \"Going home after watching 3 Idiots I felt like I'd just been to my favorite restaurant only to be a tad underwhelmed by their signature dish. It was a satisfying meal, don't get me wrong, but not the best meal I'd been expecting.\"[149] Shubhra Gupta from The Indian Express also gave it 3 stars, stating \"3 Idiots does not do as much for me. The emotional truth that shone through both the Munnabhai movies doesn't come through strongly enough.\"[150] Raja Sen of Rediff gave the film two out of five stars and states: \"Rajkumar Hirani's one of the directors of the decade, a man with immense talent and a knack for storytelling. On his debut, he hit a hundred. With his second, he hit a triple century. This time, he fishes outside the off stump, tries to play shots borrowed from other batters, and hits and misses to provide a patchy, 32*-type innings. It's okay, boss, chalta hai. Even Sachin has an off day, and we still have great hope.\"[151]"
        },
        {
          "type": "paragraph",
          "text": "Overseas"
        },
        {
          "type": "paragraph",
          "text": "On the review aggregator website Rotten Tomatoes, 100% of 15 critics' reviews are positive, with an average rating of 7.3/10.[152] Derek Elley of Variety wrote that \"3 Idiots takes a while to lay out its game plan but pays off emotionally in its second half.\" Robert Abele of Los Angeles Times wrote that there's an \"unavoidable joie de vivre (symbolised by Rancho's meditative mantra 'All is well') and a performance charm that makes this one of the more naturally gregarious Bollywood imports.\" Louis Proyect described it as a \"fabulous achievement across the board. A typical Bollywood confection but also a social commentary on a dysfunctional engineering school system that pressures huge numbers of students into suicide.\"[24]"
        },
        {
          "type": "paragraph",
          "text": "The film was praised by critics in East Asia and Southeast Asia. South China Morning Post wrote that the film \"wraps a heavy message in light comedy. It is satire at its best, a powerful indictment of India's education system in which students cram for exams while stifling their dreams.\"[5] Chaerim Oh of KAIST Herald wrote that \"the film never harshly denounces the educational system but instead uncovers disturbing truths and unseen consequences of tremendous pressure upon students\" and that \"if you don't end up crying like I did (or won't admit that you did), you'll still enjoy the movie.\"[7] In Japan, Yuri Wakabayashi of Eiga also gave the film a positive review.[153]"
        },
        {
          "type": "paragraph",
          "text": "ZNMD"
        },
        {
          "type": "paragraph",
          "text": "Zindagi Na Milegi Dobara (transl. You only live once), is a 2011 Indian Hindi-language road comedy drama film directed by Zoya Akhtar and produced by Farhan Akhtar and Ritesh Sidhwani under Excel Entertainment. The film stars an ensemble cast consisting of Hrithik Roshan, Abhay Deol, Farhan Akhtar, Katrina Kaif, and Kalki Koechlin. The film's story follows three childhood friends, Arjun, Kabir, and Imran, who reunite for a three-week road trip. They set off to Spain and meet Laila, who falls in love with Arjun and helps him overcome his compulsion to work. Kabir and his fiancée Natasha experience significant misunderstandings, while Imran wishes to meet his biological father, an artist."
        },
        {
          "type": "paragraph",
          "text": "It was filmed across Spain, India and the United Kingdom on a budget of ₹45 crore (equivalent to ₹93 crore or US$11 million in 2023). The music and background score were composed by Shankar–Ehsaan–Loy with lyrics written by Javed Akhtar. Zindagi Na Milegi Dobara was initially planned to release on 27 May 2011, but technical problems with post-production work led to the release being postponed to 24 June, and again to 15 July of that year. The film had a worldwide release on 1,800 screens and was a commercial success grossing ₹1.53 billion (US$18 million) and received critical acclaim[4] for its direction, story, screenplay, music, dark humor, cinematography and performances of the ensemble cast."
        },
        {
          "type": "paragraph",
          "text": "The film is widely regarded as one of Farhan Akhtar's finest acting performances, with particularly praise for his dialogue delivery and comic timing.[5][6] At the 57th Filmfare Awards, Zindagi Na Milegi Dobara received a leading 13 nominations, and won a leading seven awards, including Best Film, Best Film (Critics), Best Director and Best Supporting Actor (Farhan Akhtar). Additionally, at the 59th National Film Awards, it won two awards – Best Choreography (Bosco-Caesar for \"Señorita\") and Best Audiography (Baylon Fonseca)."
        },
        {
          "type": "paragraph",
          "text": "Plot"
        },
        {
          "type": "paragraph",
          "text": "At the beginning of the film, Kabir proposes to Natasha. At their engagement party, Natasha learns that Kabir is planning a three-week bachelor road trip to Spain with his high school friends, Imraan and Arjun. Kabir explains that the three have a long-standing pact, and during the road trip, each of them will have to pick an adventure sport, which all three will try together. Arjun, however, is reluctant to take part in the trip due to his workaholism as a stockbroker, which also caused his ex-fiancée Rohini to leave him. Imraan has an additional personal agenda on the trip – to find his biological father Salman Habib, an artist in Spain, despite his mother's protests."
        },
        {
          "type": "paragraph",
          "text": "The trio set off to Spain, where they plan to visit the Costa Brava, Seville, and Pamplona. On their way, Imraan throws Arjun's phone out of the window in the middle of a work call, which enrages him. They have an argument about Imraan sleeping with Arjun's then-girlfriend Sonali back in college (who later ditched Imraan too), and Arjun asks him to not apologise unless it's wholeheartedly. Kabir stops the argument by advising them not to bring Sonali up since she had caused the trip to be cancelled four years prior and talking about her would bring a negative vibe."
        },
        {
          "type": "paragraph",
          "text": "At Costa Brava, they meet Laila, a British-Indian fashion design student. Imraan flirts with her, which makes Arjun jealous. Kabir reveals that he has chosen deep sea diving as their first sport, and they later find that Laila is their diving instructor. Arjun, who cannot swim and is aquaphobic, receives assistance from Laila in overcoming his fears, and he begins to fall in love with her, at which point, he no longer fears water. They attend the La Tomatina festival held in Buñol with Laila, where they meet her friend Nuria, who has an affair with Imraan. Meanwhile, Natasha, who has grown suspicious of Kabir's involvement with Laila, surprises him by crashing his bachelor party trip. Imraan spends time with Nuria, and Arjun with Laila. Arjun reveals that his obsession with work and money is due to his childhood trauma of financially struggling after his father unexpectedly died. After the men leave, Laila realises she has fallen in love with Arjun and chases them on a bike until she catches up. She and Arjun express their feelings for each other with a passionate kiss. Natasha is appeased and leaves."
        },
        {
          "type": "paragraph",
          "text": "Arjun, Imraan and Kabir visit Seville for sky diving, as per Arjun's choice. Imraan is forced to confront his acrophobia. After skydiving, the three men go to a bar and get into a fight with a stranger on whom they had tried to pull a prank. They are jailed after the fight. Salman, Imraan's father, bails them out and takes them to his home. While speaking to Imraan, Salman reveals that he never wanted the responsibility of a married life with kids, while Imraan's mother did, which is why he left. Imraan asks him to never apologise unless it's wholeheartedly and realises his mistake for hurting Arjun. Arjun forgives him, thus rekindling their lost bond. Kabir admits to Arjun and Imraan that he is not ready for marriage and proposed to Natasha by accident (the ring he gave her was actually for his mother's birthday), but is reluctant to call off the wedding for fear of breaking Natasha's heart and their families' disapproval."
        },
        {
          "type": "paragraph",
          "text": "The trio leave for the bull run at Pamplona. Imraan suggests they make a pact to keep their promises if they survive the event. Imraan vows to publish his poetry, Arjun vows to go to Morocco with Laila and live life to the fullest with her, and Kabir vows to tell Natasha that he is not ready to marry her. The friends gain a renewed sense of their relationships with each other, with others they know, and with themselves."
        },
        {
          "type": "paragraph",
          "text": "As the credits roll, Imraan, Kabir, Nuria and Natasha attend Arjun and Laila's wedding in Morocco. Kabir did not marry Natasha, but they are still friends and she has a new partner."
        },
        {
          "type": "paragraph",
          "text": "Cast"
        },
        {
          "type": "paragraph",
          "text": "Hrithik Roshan as Arjun Saluja[7]"
        },
        {
          "type": "paragraph",
          "text": "Abhay Deol as Kabir Dewan[8]"
        },
        {
          "type": "paragraph",
          "text": "Farhan Akhtar as Imran Qureshi[9]"
        },
        {
          "type": "paragraph",
          "text": "Katrina Kaif as Laila[10]"
        },
        {
          "type": "paragraph",
          "text": "Kalki Koechlin as Natasha Arora[11]"
        },
        {
          "type": "paragraph",
          "text": "Ariadna Cabrol as Nuria: Laila's friend[12]"
        },
        {
          "type": "paragraph",
          "text": "Naseeruddin Shah as Salman Habib: Imran's biological father (special appearance)"
        },
        {
          "type": "paragraph",
          "text": "Deepti Naval as Rahila Qureshi: Imran's mother[13]"
        },
        {
          "type": "paragraph",
          "text": "Suhel Seth as Mr. Arora: Natasha's father[14]"
        },
        {
          "type": "paragraph",
          "text": "Concha Montero as Señorita[15]"
        },
        {
          "type": "paragraph",
          "text": "Mandi Sidhu as Rohini: Arjun's ex-fiancée"
        },
        {
          "type": "paragraph",
          "text": "Anupam Kher filmed scenes as Imran's stepfather, Faisal Qureshi, but he did not make the theatrical cut.[16]"
        },
        {
          "type": "paragraph",
          "text": "Production"
        },
        {
          "type": "paragraph",
          "text": "Development"
        },
        {
          "type": "paragraph",
          "text": "In November 2009, director-writer Zoya Akhtar and Reema Kagti completed the scripting of a film after three months of work.[17] The script had the working title Running with the Bulls, before the title Zindagi Na Milegi Dobara was finalised,[18] the new title being an amendment of the line \"Zindagi Milegi Na Dobara\" from the title song of Rock On!! (2008).[19] Akhtar and Kagti incorporated real-life observations and wrote the character of Imran for the former's brother Farhan, who wrote the dialogue for the film.[20] Farhan produced the film with Ritesh Sidhwani under Excel Entertainment.[11] The theme of the film was \"three guys on the verge of making commitments in life\", according to him.[21] They used Farhan's father Javed Akhtar's poetry as a voiceover because they felt the poetry added depth to the characters and lent voice to their feelings.[22] A special poem inspired by a fan's poem was written for Katrina Kaif's character after she was cast in the project.[23] The first choice for the location of principal photography was Mexico, but was later changed to Spain because the climax features the running of bulls and Zoya wanted a country that blended history, culture, and sports.[22] The film's release date was postponed twice because its original editor Chandan Arora fell ill and they had to re-edit it.[24]"
        },
        {
          "type": "paragraph",
          "text": "Casting"
        },
        {
          "type": "paragraph",
          "text": "Initially, the producers wanted Ranbir Kapoor and Imran Khan to play two of the three leads, but they declined without specifying a reason.[25] Farhan Akhtar had worked with Zoya on her debut film Luck by Chance (2009) and also wrote dialogue for the film; Zoya felt he would know exactly what she wanted from the film.[26] He was the first actor to be cast in the film.[27] Farhan Akhtar defined his role as a \"fun character\" and a \"guy who for the longest time takes nothing seriously\".[21] Hrithik Roshan was chosen for another lead role because he was one of Zoya's favourite actors.[28] After finalising the two, she needed someone \"who could not just fit in with them visually but also bring something new to the table.\" She sought Abhay Deol for the role, as he was her friend and had worked with her before in Kagti's Honeymoon Travels Pvt. Ltd. (2007)[26]"
        },
        {
          "type": "paragraph",
          "text": "For the role of Laila, Zoya wanted someone with an accent who would be willing to scuba dive,[28] and was a half-Indian and half-Caucasian woman. A lot of women were auditioned for the part in New York and London. Later, at a party, Zoya met Katrina Kaif and chose her for the role.[18] Her role was described as \"a free- spirited girl, a wanderer at heart and a bohemian gypsy by nature\".[23] Zoya had wanted to work with Kalki Koechlin ever since seeing her in Dev.D (2009) and That Girl in Yellow Boots (2011); she felt Koechlin would suit the character of Natasha because she had \"the sense of comedy, but not over-the-top\".[29] Spanish actress Ariadna Cabrol was chosen for the role of Nuria because Zoya liked her work in the 2009 Spanish film Eloïse's Lover.[26]"
        },
        {
          "type": "paragraph",
          "text": "Filming"
        },
        {
          "type": "paragraph",
          "text": "Principal photography began in June 2010 and took place in the United Kingdom, Egypt, Mumbai, and in Spain at Barcelona, Pamplona, Buñol and Andalusia.[30][31] Cinematographer Carlos Catalan, who had worked with Zoya on Luck by Chance, wanted all three lead actors to appear tanned because he \"didn't want everything glossed over\" and wanted to make the film as realistic as possible.[22]"
        },
        {
          "type": "paragraph",
          "text": "Kaif's introduction scene was shot on a nudist beach; during the filming, the crew asked beach-goers stay out of the frame to avoid objections from the Central Board of Film Certification.[18] The La Tomatina festival of Buñol was re-created for the song \"Ik Junoon\"; almost sixteen tons of tomatoes worth ₹10 million (US$120,000) were flown in from Portugal for the scene.[32] A scene involving a kiss between Roshan and Kaif was filmed despite the couple's reluctance to do so.[33] The filming of the flamenco song \"Señorita\" took place in Alájar, a town in the province of Huelva. The crew warned local residents about the song's volume because the scene was filmed at night. On the third day of filming, locals dressed in costumes attended and the mayor of Alájar joined them.[18] The climax of the film, which features the running of the bulls, was filmed at Pamplona.[34] The final schedules were at Vashi and Alibag in Mumbai in December 2010.[35]"
        },
        {
          "type": "paragraph",
          "text": "Soundtrack"
        },
        {
          "type": "paragraph",
          "text": "Main article: Zindagi Na Milegi Dobara (soundtrack)"
        },
        {
          "type": "paragraph",
          "text": "Composer trio Shankar–Ehsaan–Loy, who had worked with Farhan Akhtar in Rock On!! (2008) and Karthik Calling Karthik (2010), composed the soundtrack for the film. The lyrics were written by Javed Akhtar. The composers engaged María del Mar Fernández, a Spanish flamenco singer, to perform the vocals on \"Señorita\"; her film-singing debut.[36] The song is also the singing debut of Roshan and Deol, who sang it along with Farhan Akhtar.[37]"
        },
        {
          "type": "paragraph",
          "text": "Marketing"
        },
        {
          "type": "paragraph",
          "text": "A Zindagi Na Milegi Dobara press conference at Chandigarh."
        },
        {
          "type": "paragraph",
          "text": "The trailer of the film was revealed with the prints of Ready which released on 3 June 2011,[38] and was released online on 15 May 2011. Excel Entertainment partnered with Aircel to make promotional videos for the film available on mobile phones and the Internet.[39] The trailer was watched over 55 million times within 48 hours of its release.[40] Two more videos—one each for the songs \"Ik Junoon\" and \"Senorita\"—were released on 27 May. The music launch and promotion event took place at Nirmal Lifestyle, Mulund, Mumbai.[41] A press conference promoting the film was held on 1 July at Chandigarh.[42] Two dialogue promos of the film were released on 3 July. On 7 July the cast and crew embarked on a road trip from Mumbai to Delhi via Surat, Vadodra, Ahmedabad, Udaipur, Ajmer and Jaipur that culminated in a concert at Gurgaon. It is believed that British Auto manufacturer Land Rover—which is now owned by Tata Motors—sponsored the Land Rover Discovery driven by the cast members during the trip.[43] A premier at the 12th IIFA Awards before the worldwide release was planned but was not executed.[44]"
        },
        {
          "type": "paragraph",
          "text": "The film's marketers released branded promotional items with Mountain Dew,[45] Gillette[46] and ING Vysya Bank.[47] A mobile video game based on Zindagi Na Milegi Dobara and the La Tomatina festival was released by Jump Games on 19 July 2011 for popular mobile operating systems.[48] OPIUM Eyewear launched exclusive Zindagi Na Milegi Dobara sunglasses[49] to promote the film."
        },
        {
          "type": "paragraph",
          "text": "Release"
        },
        {
          "type": "paragraph",
          "text": "The release of Zindagi Na Milegi Dobara was initially scheduled for 27 May 2011,[50] but was postponed to 24 June 2011[51] and again to 15 July 2011. It was released in 1,800 screens worldwide.[52] A special screening of the film was held at the residence of Shah Rukh Khan on 16 July, on the occasion of Kaif's birthday. The event was attended by several celebrities, including the film's cast and crew.[53] The far-right political party Shiv Sena criticised the event because it was held three days after the 2011 Mumbai bombings.[54] The producers of the film donated the collections of the film from around 10 theatres in Mumbai to the Maharashtra government as a mark of charity to the victims of the bombings.[55] On 24 March 2012, ZNMD was screened at Bucks New University in High Wycombe, England.[56]"
        },
        {
          "type": "paragraph",
          "text": "The film was released on DVD on 30 August 2011.[57] It is available in Dolby Digital 5.1 and stereo formats with English and Arabic subtitles.[58] The film is also available on Blu-ray disc. Later on, the film was made available in both Netflix and Amazon Prime Video."
        },
        {
          "type": "paragraph",
          "text": "Critical reception"
        },
        {
          "type": "paragraph",
          "text": "Zoya Akhtar has a unique, compelling voice and unlike many of her contemporaries, she actually respects that a cinema audience can be both intelligent and mature."
        },
        {
          "type": "paragraph",
          "text": "— Rajeev Masand, CNN-IBN[59]"
        },
        {
          "type": "paragraph",
          "text": "Zindagi Na Milegi Dobara garnered widespread acclaim from critics who praised its direction, story, screenplay, music, dark humor, cinematography and performances of the ensemble cast. On review aggregator site Rotten Tomatoes, 89% of 18 critics' reviews are positive, with an average rating of 7 out of 10.[60]"
        },
        {
          "type": "paragraph",
          "text": "Pratim D. Gupta of The Telegraph called Zindagi Na Milegi Dobara \"a beautifully scripted journey of catharsis\" and praised director Zoya Akhtar for being \"fearless in the way she shoots\".[61] In his review for Hindustan Times, Mayank Shekhar gave the film four stars praised the film as \"a game-changer for Hindi films since Dil Chahta Hai (2001), and wrote, \"What you take home are memorable, amusing moments of three truly adventurous amigos we've all grown up with. And will continue to.\"[62] Shivesh Kumar of IndiaWeekly awarded the film 4 stars.[63] Taran Adarsh of Bollywood Hungama gave the film 3.5/5, calling it a film for \"a more evolved, mature and cinema-literate audience that's geared up to embrace and support newer genres of cinema\".[64] Nikhat Kazmi of The Times of India gave the film 3.5/5 stars and lauded its lead performances; \"If Abhay is the anchor of the group, Farhan's funster role is full of beans and Hrithik's metamorphosis from uptight, money-minded stock broker to carefree vagabond is a class act\".[65]"
        },
        {
          "type": "paragraph",
          "text": "S. Chatterjee of NDTV, gave the film 3/5 stars and said its philosophy is quite old; he praised Zoya Akhtar's direction, stating, \"Zoya Akhtar, by investing the tale with a delightful lightness of touch and dollops of gentle wit, brings a degree of freshness to bear upon the plot\".[66] Shaikh Ayaz of Rediff rated the film 3.5/5 stars and wrote that Zoya Akhtar had put together a familiar plot but the film's fresh energy is entertaining. He wrote, \"Akhtar's invigorating characters pump in fresh energy into a film that could have been strictly mediocre\".[67] Kaveree Bamzai of India Today also praised for Akhtar's direction and said, \"By the time I finished watching Zindagi Na Milegi Dobara I was convinced that no one can make a romance as beautifully as a woman\", giving the film 4 stars.[68]"
        },
        {
          "type": "paragraph",
          "text": "Subhash K Jha rated Zindagi Na Milegi Dobara 3.5/5 and wrote; \"Zoya, God bless her aesthetics, sucks us into the beauty of the moment, not giving us any reason to believe that life's most precious truths are swathed in squalor\".[69] Blessy Chettiar of DNA India praised the music and Farhan Akhtar's acting as highlights of the film, saying, \"For all this, the storywriters use heavy doses of symbolism. Deep-sea diving at Costa Brava, sky-diving in Sevilla and the San Fermin bull run in Pamplona, not to forget the Tomatina festival in Buñol, where Arjun finally lets go. Fears are drowned, let open in the sky and finally at the mercy of raging bulls\", giving it 3 stars.[70] Rajeev Masand of CNN-IBN stated, \"Zindagi Na Milegi Dobara takes the light-hearted tone of a fun, all-boys road trip through Spain to give you a deep and heartfelt message on why we should live life by seizing the moment and following our hearts\". He also praised the performances, highlighting them as one of the main positives of the film, but also said the film's length \"sucks some fun of out of the ride\" and gave a rating of 3.5 stars.[59] Raja Sen of Rediff said the film \"tried too hard to be cool\" and gave it 1.5/5 stars.[14] Sudhish Kamath of The Hindu said \"Zoya Akhtar's second outing as a director is way more filmi than her first about the film industry. This one only pretends to be real. It's not.\"[71]"
        },
        {
          "type": "paragraph",
          "text": "Ryan Gilbey of The Guardian was broadly positive about the film; he wrote, \"It's still playing to full houses, and you can see why. Slick it may be. But tourist board employees representing the various Spanish cities flattered in the movie are not the only ones who will come out grinning\", and that he found the film \"stubbornly un-macho\" for a buddy film.[72] The National reviewer Kaleem Aftab, in his 4-star review wrote; \"Throwing together road trip, romcom and buddy-buddy action in a single picture may sound like an ill-conceived masala mash-up, but like any good dish, the ingredients are blended together with affection to create one of the best feel-good movies of the year\".[73]"
        },
        {
          "type": "paragraph",
          "text": "Dilwale"
        },
        {
          "type": "paragraph",
          "text": "Dilwale (transl. Big-hearted) is a 2015 Indian Hindi-language romantic comedy action film directed by Rohit Shetty, who co-produced the film with Gauri Khan under Red Chillies Entertainment and Rohit Shetty Productions. The film stars Shah Rukh Khan, Kajol, Varun Dhawan, and Kriti Sanon, alongside Pankaj Tripathi, Mukesh Tiwari, Varun Sharma, Boman Irani, Vinod Khanna, Kabir Bedi and Johnny Lever.[5][6] The film marks the final appearance of Vinod Khanna, before his death on 27 April 2017."
        },
        {
          "type": "paragraph",
          "text": "Dilwale was released theatrically worldwide on 18 December 2015, a week prior to the Christmas period. The film became a commercial success, earning over ₹376.85 crore (US$58.74 million) worldwide and becoming the thirteenth highest-grossing Indian film overseas.[7][8][9] At the 61st Filmfare Awards, Dilwale received 5 nominations, including Best Actor (Khan) and Best Actress (Kajol). The film marks the seventh collaboration between Khan and Kajol since last seen together in My Name Is Khan (2010) and the first collaboration between Varun Dhawan and Kriti Sanon.[10]"
        },
        {
          "type": "paragraph",
          "text": "Plot"
        },
        {
          "type": "paragraph",
          "text": "2015: Veer Bakshi and Raj Bakshi are brothers working as car tuners in Panaji. Veer helps Ishita and damages the car of a customer in the process. To discipline him, Raj makes Veer fix the car at night. Veer falls asleep while fixing the car and wakes up to find that the car's sound system has been stolen. Veer soon gets into a tussle with \"King\", a drug baron, whose henchmen threatened Ishita. Veer is injured and gets admitted to the hospital. Raj learns about this and thrashes the gang members, with the help of his friends Shakti and Anwar. Raj burns their stash and reveals himself as \"Kaali\". King suspects Raj to be Kaali due to the tussle between King and Veer. However, Raj's humbleness convinces King that he is harmless and makes a deal to fix their car in exchange for their safety and protection."
        },
        {
          "type": "paragraph",
          "text": "2000: In Sofia, Kaali and Veer are sons of Randhir Bakshi, a crime boss. Kaali comes across Meera during one of their chases with Randhir's rival Dev Narayan Malik. Kaali falls in love with her and the two begin to spend time with each other. During a shipment delivery to Randhir, Kaali gets attacked by Dev's henchmen and Meera reveals herself as Malik's daughter. Meera spares Kaali's life as it was her birthday. Kaali confronts Meera, chases her car and saves her life when she almost falls off a cliff. Overcome by remorse, Meera declares her love for Kaali, who eventually forgives her. Kaali and Meera reveal their relationship to Randhir and Dev, who agree to meet each other. However, Dev tries to kill Kaali and his father in a shootout. Dev and Randhir end up shooting each other to death. Meera sees Kaali holding a gun next to Dev and assumes that Kaali has betrayed her, where she shoots him. Kaali survives and is convinced by Shakti and Anwar to forget about the past and start a new life with his brother Veer, while Meera also starts a new life."
        },
        {
          "type": "paragraph",
          "text": "2015: Veer discovers that his friend Siddhu was the thief who stole the car's parts and had been giving them to his boss Oscar, but spares him as Siddhu reveals that he did this for his girlfriend Jenny. Veer proposes to Ishita. Raj learns about their relationship and decides to meet Ishita's sister, who is actually Meera. Upon meeting Raj, Meera immediately forbids Ishita from meeting Veer again. Veer and Ishita try to figure out why their siblings dislike each other so much, so Veer and Siddhu try to confront Shakti (Siddhu's brother) and Anwar. Veer and Ishita scheme together to rekindle Raj and Meera's relationship."
        },
        {
          "type": "paragraph",
          "text": "Raj's lieutenant Mani steals one of King's cars and brings it to the shop. Veer, Mani and Siddhu discover drugs in the car's decklid and burn them. Upon realising Ishita loves Veer deeply, Meera issues an ultimatum that Veer must move in with Meera in order to marry Ishita, leaving Raj in the process. Enraged, Veer proceeds to storm out and Meera reveals to Veer that Raj is actually Randhir's adopted son and not Veer's biological brother. Raj confirms this and embraces Veer. Raj confronts Meera for trying to ruin his relationship with his brother, where he reveals that he never betrayed her. Malik's right hand man Raghav meets Meera and confirms Raj's innocence. Meera takes Ishita to Raj's house, declaring that Veer can live with Raj and Ishita after marriage and Meera apologises to Raj."
        },
        {
          "type": "paragraph",
          "text": "At Siddhu and Jenny's wedding in a church, King finds his car, which is being used as a wedding car, and brings Mani, Oscar and Veer, demanding to know about his drugs. King loses his temper after learning what happened and a fight ensues in which Raj reveals himself as Kaali and thrashes King. King tries to kill Raj, but Meera takes the bullet and King is beaten up by Raj's friends. Meera is admitted to the hospital, where she recovers and reunites with Raj."
        },
        {
          "type": "paragraph",
          "text": "Cast"
        },
        {
          "type": "paragraph",
          "text": "Shah Rukh Khan as Raj \"Kaali\" Bakshi/Ramlal, Randhir's elder son"
        },
        {
          "type": "paragraph",
          "text": "Kajol as Meera Dev Malik (Pogo)"
        },
        {
          "type": "paragraph",
          "text": "Varun Dhawan as Veer Bakshi, Randhir's younger son"
        },
        {
          "type": "paragraph",
          "text": "Mitansh Lulla as Young Veer"
        },
        {
          "type": "paragraph",
          "text": "Kriti Sanon as Ishita Dev Malik"
        },
        {
          "type": "paragraph",
          "text": "Stuti Dixit as Young Ishita"
        },
        {
          "type": "paragraph",
          "text": "Boman Irani as King"
        },
        {
          "type": "paragraph",
          "text": "Vinod Khanna as Randhir Bakshi, Kaali and Veer's father"
        },
        {
          "type": "paragraph",
          "text": "Kabir Bedi as Dev Narayan Malik, Meera and Ishita's father"
        },
        {
          "type": "paragraph",
          "text": "Varun Sharma as Siddharth \"Sidhu\" Saigal"
        },
        {
          "type": "paragraph",
          "text": "Johnny Lever as Mani Tirupathi"
        },
        {
          "type": "paragraph",
          "text": "Mukesh Tiwari as Shakti Saigal, Sidhu's brother"
        },
        {
          "type": "paragraph",
          "text": "Pankaj Tripathi as Anwar Ali Mirza"
        },
        {
          "type": "paragraph",
          "text": "Chetna Pande as Jenny D'Costa, Sidhu's girlfriend (Voice dubbed by Deeksha Singh)"
        },
        {
          "type": "paragraph",
          "text": "Sanjay Mishra as Oscar D'Costa"
        },
        {
          "type": "paragraph",
          "text": "Nawab Shah as Raghav Shankar, Malik's henchman"
        },
        {
          "type": "paragraph",
          "text": "Pradeep Kabra as Joshua"
        },
        {
          "type": "paragraph",
          "text": "Production"
        },
        {
          "type": "paragraph",
          "text": "Development"
        },
        {
          "type": "paragraph",
          "text": "In January 2015, Rohit Shetty announced a project with Shah Rukh Khan in the lead which would be their second collaboration after the 2013 film Chennai Express. Shetty stated that he would start filming in March 2015.[11][12] Shetty paired actress Kajol with Khan, making it the seventh time they were cast opposite each other. He also signed actor Varun Dhawan who was reportedly playing Khan's brother, while actress Kriti Sanon was signed opposite him and Kajol's sister.[13]"
        },
        {
          "type": "paragraph",
          "text": "Filming"
        },
        {
          "type": "paragraph",
          "text": "Principal photography began on 20 March 2015 with Dhawan in Goa.[14][15] Khan and Kajol first joined the crew for filming in Bulgaria from June 2015.[16] Later that month, the first song from the film was shot on Dhawan and Kriti Sanon, in Bulgaria.[17] The schedule there was wrapped up by late July.[18] In August 2015, a romantic song featuring the lead pair was shot in Iceland.[19] The entire team then left for Hyderabad in early September to shoot what was touted to be the final schedule of filming.[20] However, the work in Hyderabad was completed by late October, and filming officially came to an end with a brief schedule in Goa, the same location where it was started.[21] In December, after the promotions had commenced, another song was shot in haste. It featured all four lead actors and had to be played simultaneously with the end-credits.[22]"
        },
        {
          "type": "paragraph",
          "text": "Release"
        },
        {
          "type": "paragraph",
          "text": "Theatrical"
        },
        {
          "type": "paragraph",
          "text": "Dilwale was released in the United Arab Emirates a day before its worldwide release on 18 December 2015. The film was released in around 3100 screens in India.[23]"
        },
        {
          "type": "paragraph",
          "text": "On 14 December 2015, in the United Kingdom, the film received a 12A classification from the British Board of Film Classification for \"moderate violence\". The film's UK distributor chose to remove thirteen seconds to obtain this rating (the excised material being scenes involving stronger violence than possible for a 12A rating). An uncut 15-rated version is available.[2]"
        },
        {
          "type": "paragraph",
          "text": "Home media"
        },
        {
          "type": "paragraph",
          "text": "The satellite rights of the film were sold to Sony Pictures Networks as part of a deal worth ₹2.2 billion (US$34.29 million).[24]"
        },
        {
          "type": "paragraph",
          "text": "Jawan"
        },
        {
          "type": "paragraph",
          "text": "Jawan (transl. Soldier) is a 2023 Indian Hindi-language action thriller film co-written and directed by Atlee (in his Hindi film debut).[5] It is produced by Gauri Khan and Gaurav Verma under Red Chillies Entertainment. The film stars Shah Rukh Khan in a dual role as lookalike father and son alongside Nayanthara (in her Hindi film debut) and Vijay Sethupathi. In the film, Azad, the jailer of a woman's prison, is a vigilante who recruits inmates and commits acts that shed light on corruption in India."
        },
        {
          "type": "paragraph",
          "text": "Principal photography commenced in September 2021 with filming taking place in Pune, Mumbai, Goregaon, Hyderabad, Chennai, Rajasthan and Aurangabad. The film's soundtrack and musical score were composed by Anirudh Ravichander, with cinematography by G. K. Vishnu and editing by Ruben. A few scenes were simultaneously re-shot for the Tamil version of the film, particularly Khan's appearance in the song \"Zinda Banda\" (\"Vandha Edam\" in Tamil), Sethupathi's portions and scenes featuring Yogi Babu.[6][7]"
        },
        {
          "type": "paragraph",
          "text": "Jawan was initially planned for release on 2 June 2023, but was postponed due to unfinished post-production work.[8] It was theatrically released on 7 September 2023 in standard, IMAX, 4DX and other premium formats, coinciding with Janmashtami. Jawan received acclaim from critics who praised its cast performances, direction, action sequences, musical score, story, and cinematography.[9] The film set several box-office records for a Hindi film, overtaking those set by Khan's previous release Pathaan (2023). Grossing over ₹1,148.32 crore, it emerged as the highest-grossing Indian film of 2023, the second highest-grossing Hindi film and the sixth highest-grossing Indian film.[10] At the 69th Filmfare Awards, the film received 14 nominations, including Best Film and Best Director.[11] At the 71st National Film Awards, the film won 2 awards: Best Actor in a Leading Role (Khan) and Best Female Playback Singer (Shilpa Rao for \"Chaleya\").[12]"
        },
        {
          "type": "paragraph",
          "text": "Plot"
        },
        {
          "type": "paragraph",
          "text": "In the late 1980s, somewhere in Northeast India, a man is thrown off a plane into a river. The man is found unconscious by a tribal group, whose leader takes him in and cares for him for several months. When the tribe is attacked, the man wakes up and saves them. He becomes the tribe's messiah but is revealed to have lost his memory. A boy in the tribe promises that he will one day find out the man's identity."
        },
        {
          "type": "paragraph",
          "text": "Years later in Mumbai, 2023, Azad, a IPS officer who is the jailer of Belamvada women's prison, hijacks a Mumbai Metro train with a group of six inmates: Lakshmi, Eeram, Iskra, Kalki, Helana, and Janvi, holding the passengers hostage. When a police officer captures one of the group, Azad ties him up but doesn't hurt him. Azad also shoots a female hostage. He negotiates with Force One officer Narmada Rai to ask the Agriculture Minister to send ₹40,000 crores in exchange for the hostages' lives. During this time, he narrates to a passenger named Alia the tragedy behind the suicide of Kalki's father, a poor farmer, who was harassed by the bank over his inability to pay loans to the hostages. Kalee Gaikwad, a global arms dealer, learns that Alia, who is his daughter, is one of the captives and agrees to fund the deal. Azad plans to donate the money toward the loan waiver of 7,00,000 impoverished farmers in the country. It is also revealed that the hostage shot was secretly one of hijackers and is not wounded at all. Azad and his gang transfer the funds into the farmers' bank accounts and escape. Through Alia, Azad reveals his name as Vikram Rathore to Kalee."
        },
        {
          "type": "paragraph",
          "text": "Narmada's daughter, Suchi, has been searching for a husband for her mother and is impressed by Azad, who lives with his adopted mother, retired jailer Kaveri Amma. Upon her daughter's request, Narmada meets Azad. After sharing their views and understanding each other, they get engaged, although Narmada is unaware of his alter ego."
        },
        {
          "type": "paragraph",
          "text": "Azad and his gang kidnap the Health Minister and demand better infrastructure at a dilapidated government hospital in exchange for the Health Minister's life. Azad reveals that Eeram, who was a doctor at that hospital, demanded oxygen cylinders for children suffering from Encephalitis, but was denied the supply due to negligence and corruption by the Health Secretary, who is forced to reveal that Eeram was never at fault. The infrastructure is immediately upgraded and Azad and his gang escape again."
        },
        {
          "type": "paragraph",
          "text": "After they get married, Narmada discovers Azad's alter ego, and Kalee's brother Manish also uncovers this secret, leading to the couple being captured and tortured. Azad is rescued by the real Vikram Rathore, who turns out to be his doppelgänger. Narmada confronts Azad's accomplices in the prison by disguising herself as an inmate, where she learns about Azad and Vikram's connection."
        },
        {
          "type": "paragraph",
          "text": "Past: Captain Vikram Rathore, a commando in the Special Ops unit of the Indian Army, is sent in 1993 on an operation in which his team faced casualties caused by malfunctioning weaponry. Vikram and his team filed a complaint against Kalee, who is the supplier of the weapons. On the same night, Kalee attacked Vikram and his wife Aishwarya, separated them, and shot Vikram off a plane. Aishwarya is sentenced to death for killing three cops on Kalee's payroll, who were threatening her. Vikram is declared a national traitor. Aishwarya's execution was postponed for five years when it's discovered that she's pregnant, with Azad, on the gallows. When Azad turns five, in her final words to him, Aishwarya asks him to prove Vikram's innocence and provide justice to the oppressed. Unknown to the world, Vikram survived Kalee's attack and has been living with the North Eastern tribe, but lost his memory."
        },
        {
          "type": "paragraph",
          "text": "Present: Back in 2023, the police officer from the train hijacking is revealed to be Juju, the boy who promised Vikram that he would find out who he is and reunites Azad and Vikram. Narmada's subordinate Irani is revealed to be on Kalee's payroll and tries to kill Azad's accomplices; Lakshmi is killed in the crossfire. Azad arrives at the prison, kills Irani and steals Kalee's trucks, with his team, Vikram, and Vikram's friends. The trucks contain money that will be used to boost Kalee's political ambitions in the upcoming elections, but during the heist, Vikram and his friends are captured by Kalee's henchmen. Azad releases a video to the public and stated that he has also stolen voting machines and demanded the sealing of 53 factories in the country responsible for air pollution and water pollution. The factories are sealed by the government. Kalee arrives at the prison after finding out that Vikram and Azad are two different people and that he never killed Vikram. A fight ensues, and Vikram finally recovers his memory after hearing a gun malfunction. He and Azad fight together to defeat Kalee and his men. Finally, they hang Kalee to death like Aishwarya was once hanged, thus avenging the injustice caused to Vikram and Aishwarya."
        },
        {
          "type": "paragraph",
          "text": "During the post-credits scene, STF officer Madhavan Naik, who helped Azad in the completion of his missions, assigns him a new mission targeting Swiss banks."
        },
        {
          "type": "paragraph",
          "text": "Cast"
        },
        {
          "type": "paragraph",
          "text": "Shah Rukh Khan in a dual role as"
        },
        {
          "type": "paragraph",
          "text": "Captain Vikram Rathore"
        },
        {
          "type": "paragraph",
          "text": "ACP Azad Rathore IPS"
        },
        {
          "type": "paragraph",
          "text": "Priyansh Vatiani as teen Azad"
        },
        {
          "type": "paragraph",
          "text": "Arijit Gaurav as young Azad"
        },
        {
          "type": "paragraph",
          "text": "Vijay Sethupathi as Kalee Gaikwad"
        },
        {
          "type": "paragraph",
          "text": "Nayanthara as Narmada Rai"
        },
        {
          "type": "paragraph",
          "text": "Priyamani as Lakshmi"
        },
        {
          "type": "paragraph",
          "text": "Sanya Malhotra as Dr. Eeram"
        },
        {
          "type": "paragraph",
          "text": "Sunil Grover as Irani"
        },
        {
          "type": "paragraph",
          "text": "Riddhi Dogra as Kaveri, Azad's foster mother"
        },
        {
          "type": "paragraph",
          "text": "Sanjeeta Bhattacharya as Helana"
        },
        {
          "type": "paragraph",
          "text": "Girija Oak as Iskra"
        },
        {
          "type": "paragraph",
          "text": "Lehar Khan as Kalki"
        },
        {
          "type": "paragraph",
          "text": "Aaliyah Qureishi as Janvi"
        },
        {
          "type": "paragraph",
          "text": "Mukesh Chhabra as Health Minister's secretary[a]"
        },
        {
          "type": "paragraph",
          "text": "Yogi Babu as Health Minister's secretary (Tamil version)[a]"
        },
        {
          "type": "paragraph",
          "text": "Eijaz Khan as Manish Gaikwad, Kalee's brother"
        },
        {
          "type": "paragraph",
          "text": "Sangay Tsheltrim as Juju"
        },
        {
          "type": "paragraph",
          "text": "Abiral Limboo as young Juju"
        },
        {
          "type": "paragraph",
          "text": "Seeza Saroj Mehta as Suji Rai, Narmada's daughter"
        },
        {
          "type": "paragraph",
          "text": "Bharat Raj as Irai Anbu"
        },
        {
          "type": "paragraph",
          "text": "Kenny Basumatary as Nazir Ahmed"
        },
        {
          "type": "paragraph",
          "text": "Raviraj Kande as Pushkar Mahajan"
        },
        {
          "type": "paragraph",
          "text": "Utsav Narula as Mahaveer Singh"
        },
        {
          "type": "paragraph",
          "text": "Jaffer Sadiq as Sudhir"
        },
        {
          "type": "paragraph",
          "text": "Naresh Gossain as Agriculture Minister of Maharashtra"
        },
        {
          "type": "paragraph",
          "text": "Ashwin Kaushal as Health Minister of Maharashtra"
        },
        {
          "type": "paragraph",
          "text": "Sukhi Garewal as Murad (Voice by Manoj Pandey)"
        },
        {
          "type": "paragraph",
          "text": "Abhishek Deswal as Abdul"
        },
        {
          "type": "paragraph",
          "text": "Sai Dheena as Kalee's henchmen"
        },
        {
          "type": "paragraph",
          "text": "Ashlesha Thakur as Alia Gaikwad, Kalee's daughter"
        },
        {
          "type": "paragraph",
          "text": "Smita Tambe as Kalki's mother"
        },
        {
          "type": "paragraph",
          "text": "Omkar Das Manikpuri as Kalki's father"
        },
        {
          "type": "paragraph",
          "text": "Vivek Raghuvanshi as Commando Alif"
        },
        {
          "type": "paragraph",
          "text": "Viraj Ghelani as Dubey"
        },
        {
          "type": "paragraph",
          "text": "Ravindra Vijay as Mukund Menon, District Collector of Mumbai City"
        },
        {
          "type": "paragraph",
          "text": "Siri Hanumanthu as Sub-Jailer of Belamvada Female Prison[13]"
        },
        {
          "type": "paragraph",
          "text": "Sharad Vyas as Judge of Mumbai Sessions Court"
        },
        {
          "type": "paragraph",
          "text": "Dorendro Loitongbam as Village Physician"
        },
        {
          "type": "paragraph",
          "text": "Leesha Eclairs as Kalee's PA"
        },
        {
          "type": "paragraph",
          "text": "Special Appearance"
        },
        {
          "type": "paragraph",
          "text": "Deepika Padukone as Aishwarya Rathore, Vikram's wife"
        },
        {
          "type": "paragraph",
          "text": "Sanjay Dutt as STF officer Madhavan Naik IPS"
        },
        {
          "type": "paragraph",
          "text": "Atlee as himself in the song \"Zinda Banda\""
        },
        {
          "type": "paragraph",
          "text": "Production"
        },
        {
          "type": "paragraph",
          "text": "Development"
        },
        {
          "type": "paragraph",
          "text": "In October 2019, it was reported that Shah Rukh Khan would collaborate with Tamil film director Atlee for his film after Zero (2018).[14] Harish Shankar, who was present at the promotion event for Bigil, confirmed the collaboration between Atlee and Khan.[15] During COVID-19 lockdown in India, Atlee narrated the story to Khan in 2020, through Zoom call.[16] In May 2021, it was reported that the filming would commence soon.[17] The film is produced by Gauri Khan under Red Chillies Entertainment, while Gaurav Verma serves as a co-producer.[18] In September 2021, the film's title was speculated to be Lion due to a permission letter from the film studio.[19] The company made a public announcement on 3 June 2022, confirming the project.[20] The film was made on a budget of ₹300 crores.[21]"
        },
        {
          "type": "paragraph",
          "text": "Atlee co-wrote the film's script along with S. Ramana Girivasan, in his fourth consecutive collaboration with the director.[22] Sumit Arora contributed the dialogues.[23] Atlee further retained most of his norm technicians including cinematographer G. K. Vishnu, editor Ruben, art director T. Muthuraj and stunt director Anal Arasu.[24] Spiro Razatos,[25] Craig Macrae,[26] Yannick Ben,[27] Kecha Khamphakdee and Sunil Rodrigues were also hired as stunt directors.[28][29] Dance choreographers of the film include Farah Khan, Vaibhavi Merchant, Shobi and Lalitha.[30]"
        },
        {
          "type": "paragraph",
          "text": "Casting"
        },
        {
          "type": "paragraph",
          "text": "Mukesh Chhabra was the casting director. Khan was reported to play a dual role, as father and son, and would be seen in six different looks.[31] Nayanthara was finalised as the female lead opposite Khan, thus marking her Hindi cinema debut. Initially was Samantha offered to be the female lead but declined the role.[32][33] Priyamani, Sunil Grover, Sanya Malhotra and Yogi Babu later joined the cast. Reuniting with Khan after a decade, Babu last acted opposite Khan in Chennai Express (2013);[34] however, he was only present in the Tamil version, while in the Hindi version, his role was played by Chhabra himself.[citation needed] Rana Daggubati was offered the antagonist role but declined citing health issues and thus the role went to Vijay Sethupathi.[35] Deepika Padukone joined the cast in August 2022 in Chennai to shoot her special appearance.[36] In September 2022, Vijay was reported to be making a cameo in the film,[37] but later Atlee denied the news clarifying that he himself was making a cameo.[38] In March 2023, Sanjay Dutt joined the cast to shoot for a cameo during an action scene.[39] Allu Arjun was approached to play a cameo but declined the role citing his commitments to Pushpa 2 (2024)[40]"
        },
        {
          "type": "paragraph",
          "text": "Filming"
        },
        {
          "type": "paragraph",
          "text": "Principal photography commenced in September 2021 in Pune.[41] Some scenes of Jawan were filmed at the Sant Tukaram Nagar metro station in Pune from 30 August to 15 September 2021. The station also appeared in the film's poster where Khan appears to sit at the metro station.[42] It became the first film to be shot at Pune Metro.[43] Additionally, a 135-foot dummy train was built and fabricated at a film studio in Goregaon where important train sequences were filmed.[44] Khan resumed the shoot in June 2022 in Hyderabad.[45] Shah Rukh Khan and Nayanthara joined the 10–days shoot.[46] Nayanthara joined the Mumbai schedule on 26 June 2022, after her marriage.[47] Some family sequences were shot during this schedule.[48]"
        },
        {
          "type": "paragraph",
          "text": "In August, the next schedule started in Chennai, where Deepika Padukone shot her cameo part. Later production moved to Thiruporur, where some important sequences were shot.[49][50] Later Vijay Sethupathi joined the shoot. Some action sequences between Khan and Sethupathi were taken in this schedule.[51][52] The song \"Zinda Banda\" was shot during this schedule, in jail.[53] The song, which shot for 5 days included 1000 dancers, and was choreographed by Shobi Paulraj. Shooting later took place in Gurgaon and Ahmedabad.[54] The song was also reshot for the Tamil version as \"Vandha Edam\".[55] A month-long Chennai schedule was wrapped on 7 October.[56][57]"
        },
        {
          "type": "paragraph",
          "text": "The next schedule was held in Rajasthan, in October.[58] Khan and Nayanthara joined this 20–day schedule.[59] Next schedule was held in February 2023,[60] where Khan shot some chase scenes.[21] Sanjay Dutt joined the shoot on 20 March 2023,[61] to shoot an action-packed cameo.[62] In April 2023, a song titled \"Chaleya\" featuring Khan and Nayanthara was shot at Mumbai and Bandra–Worli Sea Link.[63] Later the same month, the song \"Faraatta\" featuring Khan and Deepika Padukone, for her cameo appearance was shot at Film City, Mumbai.[64] Both the songs were choreographed by Farah Khan.[65] In mid July, song titled \"Not Ramaiya Vastavaiya\" featuring Khan and Nayanthara, choreographed by Vaibhavi Merchant was shot at the Yash Raj Studios in Mumbai. The climax of the movie was shot in Sarathi Studios, Hyderabad.[66][67]"
        },
        {
          "type": "paragraph",
          "text": "Post-production"
        },
        {
          "type": "paragraph",
          "text": "Post-production for the film began in January 2023 and went on for six months as the film involves extensive computer graphics and visual effects.[68] Editing was handled by Ruben.[69] The VFX work of the film is done by Red Chillies VFX.[70] Harry Hingorani served as the visual effects supervisor with Keitan Yadav as the VFX producer of the film.[71] In April, the company hired visual effects technicians to the team.[72] Ken Metzker of Red Chillies Color did the colouring for the film.[73] Kunal Rajan served as the sound designer.[74]"
        },
        {
          "type": "paragraph",
          "text": "Deepa Venkat dubbed for Nayanthara for the Tamil and Telugu versions of the film.[75] Raveena Ravi dubbed for Deepika Padukone for the Tamil and Telugu versions of the film.[76]"
        },
        {
          "type": "paragraph",
          "text": "The final copy of the film was ready by early August 2023 and was submitted to the Central Board of Film Certification (CBFC) that month. On 22 August 2023, the film received a U/A certificate from the Censor Board, with a finalised runtime of 169 minutes.[77]"
        },
        {
          "type": "paragraph",
          "text": "Influences and themes"
        },
        {
          "type": "paragraph",
          "text": "According to Shah Rukh Khan, the film's theme is about \"Women's empowerment\".[78] Agnivo Niyogi in The Telegraph argues that Jawan pays homage to several SRK films including Phir Bhi Dil Hai Hindustani, Chak De! India, Swades, Chennai Express,[79] and India Today also discusses how Chak De! India influenced Jawan.[80] The Hindu adds that Jawan references Main Hoon Na, Rab Ne Bana Di Jodi, and Duplicate.[81] Jawan has also drew inspiration from The Dark Knight Rises, and one of the inspirations was from Bane's Mask, creating the character Mr.D.[82]"
        },
        {
          "type": "paragraph",
          "text": "Dr. Eeram, who is one of the key characters in the film, is inspired by real-life events and individuals. Dr. Kafeel Khan, who hails from Gorakhpur, Uttar Pradesh, serves as the inspiration for this character. Dr. Khan became widely known for his involvement in the 2017 Gorakhpur hospital deaths. Dr. Khan was arrested and faced legal troubles related to the incident, which brought attention to systemic issues within the healthcare system. In the film, Dr. Eeram's character likely explores themes of medical ethics, responsibility, and the challenges faced by healthcare professionals.[83] The film also explores factors contributing to farmers' suicides in India.[84]"
        },
        {
          "type": "paragraph",
          "text": "A scene featuring Vikram Rathore and Kalee Gaikwad draws inspiration from the Bofors scandal, which was a major political and financial controversy in India related to the purchase of Bofors Howitzer for the Indian army. The scandal revolved around allegations of corruption and kickbacks in the arms deal, which had a significant impact on Indian politics and defence procurement. In the film, this scene sheds light on issues of corruption, political intrigue, and the consequences of unethical decisions made in high-stakes situations. The character Kalee is referred to as AB Bofors, which likely signifies a symbolic representation of the scandal, emphasising the role of individuals and entities in larger scandals and controversies. Kalee's character serves as a metaphorical link to the scandal, exploring the themes of accountability, responsibility, and the impact of corruption in society.[85]"
        },
        {
          "type": "paragraph",
          "text": "Music"
        },
        {
          "type": "paragraph",
          "text": "Main article: Jawan (soundtrack)"
        },
        {
          "type": "paragraph",
          "text": "The soundtrack is composed by Anirudh Ravichander, working with Shah Rukh Khan and Atlee for the first time; this would also mark his debut as a solo composer in Bollywood, previously having composed a song for David and the background score for Jersey.[86][87] Initially, A. R. Rahman was reportedly approached by Atlee to compose for the film.[88] Rahman subsequently declined the offer for reasons unknown, and Anirudh was chosen to compose for the film.[89] The music rights were bagged by T-Series for ₹36 crore,[90] which was a record price for a Hindi album.[91]"
        },
        {
          "type": "paragraph",
          "text": "The soundtrack consists of seven original songs composed by Anirudh, namely, \"Zinda Banda\", \"Chaleya\", \"Not Ramaiya Vastavaiya\", \"Aararaari Raaro\", \"Jawan Title Track\", \"Faraatta\" and \"Chaleya\" (Arabic). Lyrics are written by Irshad Kamil and Kumaar."
        },
        {
          "type": "paragraph",
          "text": "Marketing"
        },
        {
          "type": "paragraph",
          "text": "On 3 June 2022, the film's title and release date were unveiled through a teaser video featuring Khan in a suspicious character, wounded and swathed in bandages, foreshadowing an intriguing tale of revenge.[92] Later the film got postponed and a new release date was announced through a motion poster released on 6 May 2023.[93] A teaser trailer, titled \"Jawan Prevue\" was released on 10 July 2023.[94] It became the most watched Indian teaser in 24 hours with over 112 million views.[95] Subsequently, the teaser was attached to the prints of Mission: Impossible – Dead Reckoning Part One, Jailer and Gadar 2 for theatrical screenings.[96][97]"
        },
        {
          "type": "paragraph",
          "text": "In July 2023, when the song \"Zinda Banda\" was unveiled, the hook step, choreographed by Shobi Paulraj and performed by Khan in the music video, quickly went viral, adding to the song's popularity and becoming a social media sensation.[98] Many people have recreated the hook step (signature step) by recording their own dance performances to the song and sharing these videos across social media platforms.[99]"
        },
        {
          "type": "paragraph",
          "text": "As a part of the film's promotion, the marketing team designed the film's posters at the Mumbai Metro and Kolkata Metro.[100] The official merchandise of Jawan was launched by Fully Filmy on 25 August 2023.[101]"
        },
        {
          "type": "paragraph",
          "text": "On 30 August 2023, a grand pre-release event for the film took place in Chennai at Sri Sai Ram Engineering College, Chennai where Khan received wishes from Kamal Haasan and shared anecdotes.[102] The television streaming rights for the event were acquired by Sun Network. The event was telecasted on Sun TV and Surya TV on 3 September.[103]"
        },
        {
          "type": "paragraph",
          "text": "The official trailer of the film was unveiled on 31 August 2023.[104] On the same day, Khan arrived in Dubai to celebrate the release of the trailer with the fans and showcased it on the Burj Khalifa.[105][106] Following the film's release, Google introduced an interactive doodle dedicated to the film, allowing users to engage with and explore the film's theme in a creative and fun way.[107][108]"
        },
        {
          "type": "paragraph",
          "text": "Release"
        },
        {
          "type": "paragraph",
          "text": "Theatrical"
        },
        {
          "type": "paragraph",
          "text": "Jawan was theatrically released on 7 September 2023 in standard, IMAX, 4DX and other premium formats in Hindi along with dubbed versions of Tamil and Telugu languages.[109][110] Initially, the film was slated for release on 2 June 2023. However, in May 2023, it was reported that the film was delayed to August 2023.[111][112][113] Additionally, reports were indicating that the film might still be released on its originally scheduled date.[114] However, later it was confirmed that the film will release on 7 September 2023.[115] Jawan is the first Indian film to release in the IMAX Leonberg, the largest IMAX theatre in the world.[116] It is also the first Indian film to release in Bangladesh on the same day as its worldwide release, just like in other major countries.[117]"
        },
        {
          "type": "paragraph",
          "text": "Jawan premiered on over 10,000 screens worldwide, the highest for a Hindi film and one of the highest for an Indian film.[118] In India it released on over 5500 screens and 4500 screens in international markets.[119] In Tamil Nadu it was reported to showcase on over 650 screens and in Kerala version on over 350 screens, highest for a Hindi film in the regions.[120] The early morning shows, were held at 2:15 am across Bengal.[121]"
        },
        {
          "type": "paragraph",
          "text": "Jawan set the record for the largest bookings in Hindi cinema, surpassing the record previously held by Khan's film, Pathaan, released earlier in the year. This record was achieved in both single-screen theatres and multiplex chains.[122] Booking sites of multiplex players crashed down due to high traffic.[123][124] The film was screened at the Himalayan Film Festival in Leh on 30 September 2023.[125] The film is scheduled to release in Japan on 29 November 2024.[126][127]"
        },
        {
          "type": "paragraph",
          "text": "Distribution"
        },
        {
          "type": "paragraph",
          "text": "Pen Studios acquired the theatrical rights for North India and West India under the Pen Marudhar Entertainment banner.[128] Sree Gokulam Movies acquired theatrical distribution rights of the film in Tamil Nadu and Kerala for ₹50 crore,[129] and released under Red Giant Movies in Tamil Nadu and Dream Big Films in Kerala.[130] Sri Venkateswara Creations acquired the distribution rights for Andhra Pradesh and Telangana.[citation needed] Mysore territory rights have been acquired by Panorama Studios.[131] SVF acquired the theatrical rights for West Bengal.[132] Rajshri Productions distributed the film in Odisha,[133] and Prakash Pictures in Bihar.[128]"
        },
        {
          "type": "paragraph",
          "text": "The overseas theatrical rights were sold to Yash Raj Films.[134] Home Screen Entertainment bought the Singapore distribution rights of the film,[135] while Lighthouse Distribution acquired the distribution rights for Spain.[136] Action Cut Entertainment together with Rongdhonu Group distributed the film in Bangladesh.[137] Friday Entertainment distributed the film in France.[138]"
        },
        {
          "type": "paragraph",
          "text": "Home media"
        },
        {
          "type": "paragraph",
          "text": "The digital streaming rights of Jawan were acquired by Netflix for ₹250 crore.[139] The film's extended version began streaming on Netflix from 2 November 2023 in Hindi, Tamil and Telugu, coinciding with Khan's 58th birthday."
        },
        {
          "type": "table",
          "rows": [
            [
              "Dangal worldwide gross revenue breakdown",
              "Dangal worldwide gross revenue breakdown",
              "Dangal worldwide gross revenue breakdown"
            ],
            [
              "Territories",
              "Gross revenue",
              "Footfalls (est. ticket sales)"
            ],
            [
              "India",
              "₹511.58 crore (US$76.13 million)[165]",
              "37,000,000[166]"
            ],
            [
              "Overseas (2016)",
              "₹205 crore (US$30.02 million)[167][168]",
              "2,880,832"
            ],
            [
              "United States and Canada",
              "US$12.4 million[169] (₹85 crore)[168]",
              "1,432,000[170]"
            ],
            [
              "Arab Gulf States (GCC)",
              "US$8.8 million[169] (₹60.104 crore)[168]",
              "923,400[171]"
            ],
            [
              "United Kingdom",
              "£2.6 million[172] – $4 million (₹27.23 crore)[173]",
              "348,134[174]"
            ],
            [
              "Australia",
              "$A 2.63 million[169] – ₹14 crore (US$2.08 million)[175]",
              "190,580[176]"
            ],
            [
              "Belgium, Luxembourg, Norway",
              "US$97,152[177] – (₹12.318 crore)",
              "12,318[174]"
            ],
            [
              "Chinese markets (2017)",
              "₹1,295.1 crore (US$202 million)",
              "45,984,728"
            ],
            [
              "China",
              "¥1,299,181,400[178] – US$192.22 million (₹1,231 crore)",
              "44,897,623[179]"
            ],
            [
              "Taiwan",
              "NT$167 million[180] – ₹41 crore (US$6.3 million)[181]",
              "730,000[182]"
            ],
            [
              "Hong Kong",
              "HK$27,139,998[183] – ₹23.1 crore (US$3.55 million)[184]",
              "357,105[185]"
            ],
            [
              "Overseas (2018)",
              "₹12 crore (US$1.75 million)",
              "511,669"
            ],
            [
              "South Korea",
              "₩906.42 million[186] – US$850,000[187] (₹6 crore)",
              "109,500[186]"
            ],
            [
              "Turkey",
              "₺1,556,553[188] – US$428,201[189] (₹3 crore)",
              "364,146[174]"
            ],
            [
              "Japan",
              "¥50 million – ₹3 crore (US$438,663.83)[190]",
              "38,023[191]"
            ],
            [
              "Overseas total",
              "₹1,512 crore (US$234 million)",
              "49,377,229"
            ],
            [
              "Worldwide total",
              "₹2,024 crore[5] (US$311 million)",
              "86,402,829"
            ]
          ]
        }
      ]
    }
  ]
}